{"CS 115": [{"id": 0, "review": "go to office hours and practice"}, {"id": 1, "review": "One of my least favourite courses. Although things were nicely organized, Racket was such an annoying language to use. The one tangible benefit I felt after using Racket was feeling more comfortable with recursion."}, {"id": 2, "review": "It starts with a very low pace but after midterm, it gets really fast and I cannot understand the content while reaching the end of term. Racket is restricted by so many things so I feel I lose the freedom of coding. The assignments are extremely hard after midterm, I spent a whole day on them but I can just solve the easiest one. The only positive impression that I have is that the design recipe weighs half so I pass this course successfully."}, {"id": 3, "review": "Took this in 2018 with no programming experience ever. Started out pretty slow, but I didn't really pay attention and was severely behind. Went to a lot of office hours, but nonetheless caught up and did decently well. After taking more cs courses, racket really is a weird language."}, {"id": 4, "review": "I loved everything about cs 115. Great instructors, fair assignments ( can get tricky but there's a huge amount of office hours to attend ), good engagement and interesting topics! It's seriously well structured and I would recommend it to anyone even with no background in coding."}, {"id": 5, "review": "I recommend finding a course with a language that is actually useful. Racket is dumb and never used anywhere. The majority of the course was quite easy, except a couple of concept checks that were RIDICULOUSLY HARD. i wish i had realized sooner that you get 10% of concept checks dropped from your grade. if you understand everything and are getting most things easily but you get stumped on one particular concept check, its probably not your fault and you should skip it, at least for now. the course was very well structured and predictable. expectations were clear and reasonable. it actually was designed to be a correspondence course, so it wasnt an online course that was rushed and slapped together for covid."}, {"id": 6, "review": "I really enjoyed this course online, being co-taught by 4 professors. There were lots of office hours available to help and all of the TA's and Profs in office hours were helpful and kind. While the programming language used is not useful elsewhere, I think it is easy to understand and helped get the point of the course across. In my opinion, the point of this course is to teach you to think about solving problems and the process to go through, as you are not creating ground-breaking programs. As a student with no prior programming experience, I found this course both useful and easy if you kept up with the content and got help as soon as you needed it. The course was organized well, and the built in questions made sure you were on the right track. The assignments are fair based on what you learn. Go in with an open mind and keep up with the content and you should be just fine."}, {"id": 7, "review": "math student who took this course since I had 0 prior programming experience. the course isn't horribly hard, but if you fall behind or don't understand one lesson, everything following will be super challenging. the course was mostly online completing modules, and my biggest criticism is that solutions for lessons are never posted after they are due which makes it super challenging to do the next week's module if you didn't understand/didnt know how to write a specific code for the week. the racket language used in this course is easy to follow but not very useful and isn't used anywhere. this makes it difficult to find help outside of cs115 profs/ta's/past cs115 students. the course is oddly paced, felt the super easy and simple first half of the course, and then gets unreasonably fast. didn't find any of the profs/ta's answers to questions posted on discussion boards useful at all. because the course was only offered online, I had to essentially had to teach the whole course to myself"}, {"id": 8, "review": "The only way to do bad in this course is by not managing ur time properly. This is a mistake I made when we had to work with modules. As long as u properly manage ur time and do assignments and concept checks well before the due date, you will have a great time in this course. Also try finding connections between assignments and try finding some real world applications of racket. Trust me Racket is very useful. The only criticism I have of this course is how the course is taught because it wasn't taught. (this is when I did online.) I had to understand all concepts by myself by basically reading texts. Although There was plenty of opportunity like office hours to ask for help, I only realized that towards the end of the term. Very unfortunate :("}, {"id": 9, "review": "Can be difficult at times, but a very rewarding and fun course. Definitely made me like CS as a non-CS student! Start assignments early and definitely go to office hours. TAs and ISAs are very helpful."}, {"id": 10, "review": "This course is taught in an archaic language that no one uses and no one understands. Instructors' explanations are irrelevant to actual questions and I got yelled during office hrs even though I stated that I need a little patience (I am disabled). Assignments and quizzes are unreasonably hard. I took to take this for bioinformatics option and decided to change my future career. Truly the worst in UW history. If you don't need this course, run."}, {"id": 11, "review": "Not a bird course, although if you have background in programming it would not be difficult at all. Racket is somewhat useless but I learned some concepts that will be useful for other programming languages"}, {"id": 12, "review": "I took this course online due to the COVID-19 pandemic, so my review is based on a remote, online learning experience. Overall, as someone who is not a CS student and who doesn't have a lot of background experience and knowledge in programming, it's a great introductory course to the language of Racket and the overall concepts that will be useful in later computer science courses. The Racket language itself is not a very \"useful\" language that you may or may not use in later CS courses and even in a job, but the foundation it provides is very valuable and will definitely make you think more mathematically at programming problems. The difficulty of this course starts to increase after the midterm exam, and it does get pretty tough nearing the end. I recommend starting the assignments as early as possible and attend as many office hours if you have any questions. The course staff are very responsive and do offer a good amount of help depending on your questions. Overall, I can't say much about the in-person learning experience, but this course was suited well for online learning and I enjoyed it."}, {"id": 13, "review": "I found the online for this course to be fantastic personally. The EDx is clearly organized, and the content isn't too difficult, but provides a challenge. Can't speak to the in-person, but would definitely recommend the online. Beware though as this course is time consuming because of the amount of problems and assignments and shouldn't be mixed with a term that is already fairly difficult."}, {"id": 14, "review": "This was joint taught by a bunch of profs in the Winter term and I think it was one of the most organized online courses I took. The content modules were all written but there was a bunch of integrated questions to check your understanding. The course is really centered on your ability to reach out for help when you need it since everything was asynchronous. I think my favourite part was how office hours were 1-on-1 and there were a lot of times available throughout the day. The only thing is that some of the nicer TAs had really long wait times lol. Overall super enjoyable though, just make sure to base your design recipe on their given examples or you will lose many marks"}, {"id": 15, "review": "I think this course ran well online, the notes were very organized and easy enough to follow along and there is good support from most of the proffs and tas. The course may be a little fast for a complete cs beginner but the course has 400+ practice questions to help prepare for the weekly assignments"}, {"id": 16, "review": "It's the worst course ever, online especially. They are least interested to teach. They just provided the content to read by ourselves. I wouldn't suggest anyone to take this course online."}, {"id": 17, "review": "Nice course that teaches you how to write simple code. But little annoying that you have to do Design Recipe (especially writing an explanation for codes). There is no loop in DrRacket so being able to understand recursion is important. All course contents are based on a website and you have to read everything and code something on that website. Pity that this course will not show many algorithms or data structures. So far I think those who can just play computer games (i.e. no coding experience but can easily type using the keyboard) can easily get 90+ in this course. If you have ever coded like C, python, java, pascal and so on, easy to get 95+. Idk why the easy rate goes so low but trust me, super easy course if you finish reading the material (okay reading part may be a little boring and CS 135 provide detailed intros which seem not wordy)"}, {"id": 18, "review": "It was okay. All I can say is, do your work and submit assessments on time. Please don't procrastinate. That's what I did, and I live to regret it. This is because figuring out the solutions to each assessment problem takes time, and procrastinating doesn't help. So, submit early. Submit often. Submit. Submit."}, {"id": 19, "review": "The end of the course became quite tough but otherwise this was pretty manageable. Excellent professors and ISA's who always take our feedback and concerns into consideration to make the course experience better, including having office hours very late at night and very early in the morning. The online platform is also excellent and fun to use."}, {"id": 20, "review": "The education quality is significantly impaired with no doubt since we are doing it online. Reviews before COVID was mostly positive. But after COVID-19, a lot of them are negative. I think that reflects something. Assignment were thrown into your face like you just have one class for the whole term. For me, I believe the material we learn and the assignment we need to do is inconsistent in terms of difficulty level. The gap between them is just huge. It often took me eight to twelve hours to finish the assignment. Don't take this if you are doing online."}, {"id": 21, "review": "so difficult for beginners"}, {"id": 22, "review": "Not an \"EASY\" course at all. Anyone commentating that is probably a Math/Eng student who is already familiar with coding through other courses. Since the midterm/exam is on paper, you have to be able to imagine what your code is going to be able to do without actually testing it like you do in your assignments! Speaking of assignment, they're bloody hard! No joke, it might take you an entire day to problem solve your way through them and that might not even be enough - incredibly frustrating course and not recommended unless you really want to study coding in the future. DR. Racket is not even applicable to most organizations. If you want to learn coding, just pick up something off Amazon or get a pdf through a friend - don't spend money here unless you're actually planning on continuing studies in CS."}, {"id": 23, "review": "Must attend lectures if you're new to programming."}, {"id": 24, "review": "Pretty easy course overall! I stopped going to labs about three weeks in and still managed to get the bonus 3%. The assignments were relatively easy (with one or two exceptions)."}, {"id": 25, "review": "Very easy course if you keep up with the material and do the assignments."}, {"id": 26, "review": "It's hard to motivate yourself to do the assignments when each is 2% or something, but it really is important to keep on top of it. They only get harder and arguably the only way to guarantee that you'll do well on the midterm (since you WILL be asked to write mini programs) I personally found the exam to be much harder than the midterm, so you really need to use the midterm as a grade booster."}, {"id": 27, "review": "Reviewing as a science major, this course was definitely the one that set me up with programming. Even though it was Dr. Racket, concepts were easy to follow. Be sure to go ask a lot of questions if you do not understand."}, {"id": 28, "review": "A good start in cs though Racket seems useless in the future study..."}, {"id": 29, "review": "Racket sucks, but the content of the course was easy enough to digest if you never did programming before. Seek help if you need it (early) and don't be afraid to talk to the TAs and profs!"}, {"id": 30, "review": "A great course, but a little strange if you're used to object oriented programming."}, {"id": 31, "review": "This course was my favorite in first year. It's really fun. I enjoyed writing codes a lot."}, {"id": 32, "review": "It you get stuck on an assignment, take a break and revisit later. Don't let assignments become a time-sink."}, {"id": 33, "review": "well racket, it is ok"}, {"id": 34, "review": "i hate racket"}, {"id": 35, "review": "Really easy. I had no previous coding experience and I picked it up the concepts super quickly. You have to go to class though. Slides are NOT enough"}, {"id": 36, "review": "CS 115's content wasn't too hard and is very accessible to first time coders. Be prepared to sometimes have to put in a good chunk of time for the weekly assignments, but the assignments help you out a lot with problem solving skills and becoming more comfortable with coding in general."}, {"id": 37, "review": "SO easy, didn't pay attention in the lectures, just used course notes."}, {"id": 38, "review": "If you feel like you have sufficient Computer Science experience, go to CS 135 because it does challenge you more. This is a good introductory course to learn programming. Also, Racket needs some getting used to."}, {"id": 39, "review": "Interesting, gg"}, {"id": 40, "review": "Take CS 135 or 145 if you have prior programming experience. The majority of this course is exceedingly easy if you already know programming basics. It may only possibly get difficult at the very end. The design recipe and templates are the hardest thing for the majority of the course."}, {"id": 41, "review": "Please be very careful about the design recipe (especially tests and examples)"}, {"id": 42, "review": "SO MUCH FUN OMG"}, {"id": 43, "review": "Trivial course."}, {"id": 44, "review": "Pretty gentle introduction to programming"}, {"id": 45, "review": "It's pretty much an introduction to computer science concepts like recursion,BSTs and other abstract data types. It's VERY useful if you have no prior experience with programming."}, {"id": 46, "review": "do not take this as an elective unless coding/math is easy for you! there are a lot of concepts, impossible to teach yourself from the course notes because of how poorly organized they are. lectures are impossibly boring. My best friend tutors this class and I still justtttt scraped by. language is not super useful in life. many of my friends have taken this course because they heard it was easy and ended up failing."}, {"id": 47, "review": "Was a nice way to learn recursion, which is essentially the purpose of this course. They also give a lot of free marks with a 3% lab bonus - DO THEM! That 3% can make a big difference in your mark."}, {"id": 48, "review": "fuck i hate design recipe. your lose marks for nothing!"}, {"id": 49, "review": "I have never coded before so i opted to take this rather than CS135. This was really easy for me. I'm glad I took it though becuase it saved time so I can focus more on actual courses for my major (MATH145, PHYS121 etc). Don't expect to be able to code anything after this, especial since you use dr Raket. And the design recipes are a pain, my tip is put 20 test cases for everything."}, {"id": 50, "review": "Thanks to Keiko Katsuragawa, the prof who doesn't know how to type properly or speak English at a comprehensive level, I can't stand this easy CS course. Very prof dependent, but generally easy."}, {"id": 51, "review": "bring netflix."}, {"id": 52, "review": "Joke course if you're a CS major who is taking it just to get a good CAV (to transfer from regular to co-op, that is)."}, {"id": 53, "review": "Elementary course in CS. Have fun!"}, {"id": 54, "review": "Read the coursenote and only go to class for clicker questions"}, {"id": 55, "review": "Really easy course. Especially if you have coded before. Assignments get a little harder at the end but both the midterm and finals were easy. The only thing I hated about this course was how annoying using Dr. Racket can be at times."}, {"id": 56, "review": "People who like computer science will like this course."}, {"id": 57, "review": "great intro course for students with no background experience in CS and who don't plan on pursuing CS in the future. It can be prof dependent though."}, {"id": 58, "review": "This course tests your logic"}, {"id": 59, "review": "Entry-level cs course, no complicated stuff,easy assignments and midterms."}, {"id": 60, "review": "Easiest CS course this university has to offer. Basic math and you're good to go."}, {"id": 61, "review": "They teach Dr Racket in this course. No one ever uses Dr Racket. This is waste of time but can't skip it either."}, {"id": 62, "review": "For someone with no history in writing programs this was a very cool course. Lectures were difficult to pay attention to but I liked the overall skill set I came out of the course with. Also learned that coding can be very frustrating (you can easily get stuck at a road block for significant amounts of time) yet very rewarding (no better feeling than finally getting your program to run)"}, {"id": 63, "review": "Good course for my first CS course."}, {"id": 64, "review": "The course was relatively easy, but the midterm was setup poorly - the focus was not on core concepts but on the exactness of the stepping problems, which I don't think is useful at all."}, {"id": 65, "review": "I had no programming experience before this class and it still wasn't too hard for the most part. A good elective. Some assignments were tricky but the exams were easy."}, {"id": 66, "review": "Weekly assignments are not worth much, but are difficult. Weekly labs. 1 midterm, 1 final. Doing the labs will greatly help with the assignments. Asking questions to TAs and prof will help a lot."}, {"id": 67, "review": "Pretty easy straight forward introductory CS course. People complain but scheme syntax but personally I don't mind prefix notation at all."}, {"id": 68, "review": "didn't like it, I was lucky I passed"}, {"id": 69, "review": "Awesome course, isn't too difficult like CS 135, but actually teaches you some good things. If you're looking for a not too difficult CS course, this is it right here. Make sure to leave a few hours aside to get through the assignments, they can be a bit tricky. Easy exams."}, {"id": 70, "review": "Never taken anything even remotely related and this was super easy. Read the modules, take a couple hours each week to do assignments, easy enough midterm and final."}, {"id": 71, "review": "Genuinely easy course..."}, {"id": 72, "review": "easy course"}, {"id": 73, "review": "So Easy. Just follow the course notes. It literally tells you how to do everything you need to do. Assignments take some time, so leave a few hours aside for them. Otherwise this class is super easy."}, {"id": 74, "review": "Since I had prior programming experience this course seemed kind of useless. The language is good for teaching though."}, {"id": 75, "review": "A good introductory course into CS (IMO CS 100 doesn't count because it's about making an ancient website or something like that). A little difficult at first, but once you get into it, and get into the CS way of thinking it's pretty easy. It also gives you a better appreciation for the stuff programmers do, and allows you to understand their work better."}, {"id": 76, "review": "The programming language (Scheme/Dr.Racket) wasn't a very good program to use but the concepts behind it are the same I guess ..."}, {"id": 77, "review": "Go to the TA's for extra help(they offer free private sessions) and the class is not so bad, even for first time computer science students!"}, {"id": 78, "review": "Interesting and easy, once you get the hang of it."}, {"id": 79, "review": "Easiest"}, {"id": 80, "review": "A starting course for CS noobs like me....XD"}, {"id": 81, "review": "hard at first, will get use to it"}, {"id": 82, "review": "Even though Scheme was a very weird language, it was still an easy course overall, read the modules and you will do well."}, {"id": 83, "review": "A nice intro to coding, especially for those who probably won't take more in upper years; it's good to know the basics."}, {"id": 84, "review": "Work only in Scheme."}, {"id": 85, "review": "The course was not very hard. The language used was Scheme, which I did not like and found it to be very tedious. It is not as fun as other languages. The course however was good overall."}], "STAT 230": [{"id": 0, "review": "The course is not hard at all as long as you know how to apply the formula to the questions. It is pretty straightforward, just try to classify the questions and pick the right formula then do some calculations. Some people find it difficult, I think they tried too hard. In this course, you do not need a very deep understanding, just try to be on the surface."}, {"id": 1, "review": "I found this course fairly difficult, but it got easier after the 2nd term test. The quizzes and term tests always felt too long for the time given (especially the multiple choice). However, the marking scheme had some leniency (only 3/6 quizzes counted). The professors also seemed to care and put effort into answering questions on piazza. Lots of practice problems in the textbook."}, {"id": 2, "review": "An excellent introduction to probability. The first third of the course was a review of high school probability (sample spaces, permutations, combinations, etc.). In contrast, the second half introduced some new concepts such as different distributions (poison, exponential, etc.), expected value/variance, and multivariate distributions. The hardest part was definitely the last 2 chapters (multivariate distributions/moment generating functions) as not a lot of time was spent on those sections, but the rest was well paced. For spring 2022, the course was 15% quizzes (best 3/6 taken), 25% for the best midterm, 10% for the worst midterm, and 50% for the final. All of the tests/quizzes were fair. All in all, an excellently executed course."}, {"id": 3, "review": "It starts off with some high school Data Management review, but then gets more challenging towards the end with theory just building up to the CLT and MGF's by the end. Luckily, my term didn't get tested on those :). Overall it's a good course, especially to learn how to properly use a calculator, but don't forget the material for STAT 231!"}, {"id": 4, "review": "Good introduction to probability and probability distributions. I found the content to be dry at times and am not a fan of the formatting of the course notes (just looks like walls of text to me). However, they did contain ample practice problems which were very useful for studying as similar questions pop up on assessments. The grade breakdown was generous in which 3/6 quizzes were dropped and the mark of your better term test of the two gets boosted."}, {"id": 5, "review": "DO NOT USE THE TEXAS INSTRUMENTS CALCULATOR. it does not have factorial, choose or permute. either \"cheat\" by using a better calculator, like the casio fx-300es plus or buy the casio fx-300ms with the pink tie from the wstore. both these calculators have factorial, choose and permute. they also have a stats mode where you can enter a table of values and probabilities which you can use to cut down time on the quizzes and exams, search up a youtube tutorial if you want to learn about it, its not too necessary, it just helps you spend less time, which I regularly ran out of before fully finishing most later quizzes and exams."}, {"id": 6, "review": "Well made course with interesting content. However, consider taking STAT 241 if you would like to do a bit more proofs."}, {"id": 7, "review": "fuck stats."}, {"id": 8, "review": "Solid course, no assignments only quizzes, tests and final, but 3 out of 6 quizzes are dropped and the test you do worse on is worth much less, so you've got a lot of chances to get ur grade back up if you do bad. Content is alright course notes is workable lecture notes are better. Hintz' notes and examples and explanations are especially good."}, {"id": 9, "review": "It's such a valid course. Get an interesting and cool prof!!! I sat in on it with a boring prof and it was a boring, disengaging course, and then I took it with Hintz and now I don't understand why people think that it's a bad course. The evaluations are fair, and the material is pretty intuitive with an okay amount of straight knowledge/memorisation stuff."}, {"id": 10, "review": "STAT shouldn't be a requirement to CS. Make sure you learn EVERYTHING in this course, in particular the normal/gaussian, poisson, and exponential distributions, and MEMORIZE all the formulas on the formula sheet. If you don't you WILL FAIL STAT 231. I had to WD 231 because I didn't do this course well enough. Hoping I pass it the second time around..."}, {"id": 11, "review": "Very useful course but midterm and Final are much harder than normal quizzes. I took it online"}, {"id": 12, "review": "I'm really bad at stats, so take this with a grain of salt. But it was a very broad course, so there was a LOT to remember. Actually struggled, even though I know lots of people who found it straightforward. Took it online in Spring 2021"}, {"id": 13, "review": "took it with Don McLeish in Winter 2022. not easy at all, don't know how I passed the course."}, {"id": 14, "review": "online version is easy"}, {"id": 15, "review": "Nice course. Assignments and quizzes were easy but the midterm and final were kind difficult because we didn't get much time. If you prepare for it, shouldn't be too hard."}, {"id": 16, "review": "Lectures were boring and dry, though not necessarily the fault of the prof. Assessments felt noticeably harder than the content covered in classes."}, {"id": 17, "review": "stats is just combinatorics but worse"}, {"id": 18, "review": "Took the course online with in-person tutorials. Quizzes were fair and we had 3 attempts each. Assignments took some time but weren't too bad. Content got really a lot harder in the last two weeks, but luckily it wasn't the focus of the exam. Overall a really important and (mostly) enjoyable course."}, {"id": 19, "review": "Easy course up until the last three weeks. Module examples and review questions are enough for quizzes, but practice problems in the course notes are better to prepare for the midterm and final, which were average difficulty. Exam MC questions are modified quiz questions. Exam written questions are same difficulty as course notes problems"}, {"id": 20, "review": "A pretty good online course. You get three attempts for the quizzes, and questions are pretty similar between attempts so you can spend all the time you need to figure out things you don't understand. The course had 3 assignments that were literally worth like 1% combined. You probably don't even have to do them, but the instructors use these assignments to teach you the R language. I found the midterm and final to be pretty fair. There were no surprises and depending on your familiarity with R or some other programming language, you could bruteforce some questions to check your answer."}, {"id": 21, "review": "Notes were unorganized and no help on piazza, barely survived the chapter quizzes"}, {"id": 22, "review": "Being my first stats course ever, I really struggled in the beginning with a lot of new concepts and techniques. As the course went on, things started to click, but nonetheless, it was still stressful. Probably due to the online lectures being hard to understand and essentially learning the entire course from the course notes. An overall good foundation for future stat courses."}, {"id": 23, "review": "This course isn't that hard and also has some real-world applications which are what I like. We basically had to teach the entire course ourselves with online which wasn't bad, but I'm not the best at stats so I found it a bit tough. But after enough practice, I was able to grasp a lot of the details and ended pretty well."}, {"id": 24, "review": "Online course delivery was similar to Math137/8 - slow, online Mobius videos. For the most part, the videos covered everything you need but for some weeks the videos were scuffed in that they assumed you had knowledge that you didn't have yet - in these cases, I'd recommend taking a look in the textbook. Greg Rice's in-person, weekly tutorials were godly - they covered the whole week's content + good examples + some hints about what to expect on the exams. Overall, the course was pretty light imo though I know some people struggled with the timing on exams (not enough time to finish), so make sure you practice that when prepping for exams. My biggest piece of advice (for online delivery) would be to get used to using R commands for calculating distributions - they make your life a lot easier & save time on exams."}, {"id": 25, "review": "Overall I have mixed feelings about this course. There were things I liked about it and did not like about it. What I liked about this course it that it has many applications and that it was more computational based rather than strictly proof based. The course notes are quite useful and there are a lot of practise problems they give you that will help you feel more prepared for exam and even your upcoming assignments. I really like that the course notes are detailed as well. With that being said here are the things I did not like about the course... The course is basically a \"teach it yourself course\". There are weekly mini lectures you can watch which provide maybe 30-40% of the lesson where as you're expected to read the course notes as well because just going off the mini lectures will not help you with much of the quizzes unfortunately. Meaning that there are quiz topics that aren't covered in the Mobius but that are discussed from the notes. For the assignments, they aren't bad they are just annoying since a lot of it is done in R and I am more of a solve by hand guy rather than software. What I mainly did not like about the course again, was the fact it was more of a self learning course and that there weren't any live classes, or extra weekly live tutorials for online students. Make sure to study hard for the midterm and final because there are a lot of questions for the time they give you."}, {"id": 26, "review": "Took this course online in Fall 2021. Content before mid-term was relatively easy and digestible. However, content after the midterm, at least for me, became progressively more and more confusing and extremely difficult to understand. Assignments and weekly quizzes were very easy though."}, {"id": 27, "review": "Statistics are fundamentals of many paths in CS, the course is very useful. It's also easy if you solve the extra problems in the course notes and the bonuses in the assignments."}, {"id": 28, "review": "This course emphasizes too much on combinatoric computation which is annoying. The midterm and the final exam are made almost impossible to finish. The bonus marks are easy and hard to get since you have to spend a lot of time analyzing or computing or asking your computer to compute. But I highly appreciate those bonus questions such as the Markov chain's problem, those are the few questions that make me feel worth taking."}, {"id": 29, "review": "Not an easy course, but not hard either. I would say this is definitely easier than MATH 138 though. The concepts were not super interesting since I really only enjoy applied CS stuff hahaha, but it was not dry and boring either. The one aspect I really liked about this course is that it is applied, there were not any proof questions whatsoever which was superb. If you enjoy something applied and are at least somewhat interested in data science, you would enjoy this course. My complaint about this course is that it felt like you literally self-taught yourself in this course, the instructors will not help you on the assignments (at least in my offering). There were lecture video and weekly recap but I found the course note to be your best bet to learn the materials as it explained concepts thoroughly with so many examples and practice problems (which make me happy since some math class just assume you know a lot or are proficient enough at math, def not me haha). Overall quite a decent course."}, {"id": 30, "review": "Easy until some point, then it becomes just too complicated for my little brain. Definitely useful though."}, {"id": 31, "review": "I really hated the way this course was run in Spring 2021, the instructors were useless, please DO NOT take this course if any of these three profs are teaching: James Adcock, Steve Drekic, Pavel Shuldiner. They are really unhelpful and their go to suggestion is, \"Read the Announcements on LEARN\". I do not know which prof woke up one day and was like we are not going to allow them to go back to a question and also block access to Piazza during exams so that not even private posts can be made. This course will probably be my lowest grade so far which was made difficult and painful unnecessarily."}, {"id": 32, "review": "Fuck this course, I don't understand why the R assignments are so tough. What's with the lack of practice questions as well. Questions are either plug and chug or some whimsical form of a concept that won't come across to you after an hour"}, {"id": 33, "review": "Easy course, shit profs. If you want to help out your classmates then just type out outright wrong responses on Piazza, that way Pavel's fragile ego will get hurt and he'll go out of his way to help them. It's like a little kid who doesn't want to talk to you till they can roast you for saying wrong shit. Midterms are absolute pain. WHO THOUGHT ALLOWING QUESTIONS TO BE ONLY VIEWED ONCE WAS A GOOD IDEA? IT DOES NOT MAKE ANY SENSE. And then they messed up so many students by asking students to first input the answers on Mobius, then show the working on Crowdmark. Anyways I am almost done with this course and sorry for those who will have to endure it :)"}, {"id": 34, "review": "awful course, bad organization, but I think it's because it was online, probably in person is better"}, {"id": 35, "review": "Easy 99, I didn't learn anything."}, {"id": 36, "review": "Taught sooo badly"}, {"id": 37, "review": "The concepts are easy but the midterm/final can be hard depending on how the questions are being asked."}, {"id": 38, "review": "The course is run really well. Lecture videos and course notes have a lot of info. I just wish profs were more active on Piazza. The format of the course is nice, weekly mobius quizzes are typically quite easy, just study up a couple hours beforehand. The midterm and exam however were a time crunch and probably my most stressful exam. Overall, great course, no crunch until exams start."}, {"id": 39, "review": "Not a terribly difficult course. Material is relatively interesting. Lectures are clear and tons of notes available."}, {"id": 40, "review": "I will be super honest with this course. This course is actually very useful and can be \"relatively\" easy when compared with other tough courses such as Math239. But it sure isn't \"easy\" or less demanding. You must study a good chunk of it every week and ace the weekly quizzes and study LOTS before the exams to get ace the exams as well. If you want 95+, my advice is to not watch the lectures (too long), just read the course notes as they are explained in more detail and contain some great advanced questions that will get you prepared for the hard questions that you may encounter in quizzes or the exams. The assignments are very straightforward, so do not stress too much by the amount (they are quite long), but make sure you study LOTS! Because they are actually useful and will come in handy in future courses. But I personally did not enjoy the structure of how this course was run in my term (during covid-19). But otherwise, very useful course."}, {"id": 41, "review": "Computationally intense, dry, and useless. There's no need to understand any of the content, you can just \"plug and chug\" until you get all the answers. I did not learn anything other than how to do well in Stat 230."}, {"id": 42, "review": "Quite enjoyed it. Fun and fair"}, {"id": 43, "review": "Perhaps too easy to be useful. Literally did nothing and passed with a 95. Learn your materials kids."}, {"id": 44, "review": "The course notes are fantastic."}, {"id": 45, "review": "Not a bad course! Taught myself everything pretty easily"}, {"id": 46, "review": "It was very easy in the beginning; very similar to high school data management. However, there were too many distributions and it got more and more difficult towards the end."}, {"id": 47, "review": "Very fun and interesting course. If you took stat in high school this is an easy 80. All the exams and tests were fair."}, {"id": 48, "review": "There were no TAs or piazza during the spring term.. always had to wait in office hours. We had 3 quizzes and they were alright"}, {"id": 49, "review": "went in final not knowing what cdf was, ezpass"}, {"id": 50, "review": "The course starts off easy, but gets quite difficult towards the end. The midterms and final have some super difficult questions, but also some trivial ones for easy marks so getting a decent mark isn't hard."}, {"id": 51, "review": "Good intro to probability. Fair course if put in the work to understand the concepts and practice. Interesting content."}, {"id": 52, "review": "Excellent Course"}, {"id": 53, "review": "Introduction to probability principles, then goes onto discrete and continuous distributions. Some say the first half of the course is easier while others say the second half is. It's a very computation heavy course, so if you're not good at proofs, it might be the course for you. Overall, it's a very straightforward course."}, {"id": 54, "review": "Some concepts are much harder than others."}, {"id": 55, "review": "A useful introduction to probability and to upper year stats courses. The first part is combinatorics and can get tricky to understand, the second is more theoretical and is definitely harder. Overall it was a good course that required time to understand. Midterms were fairly easy but final was definitely harder. Took it with Greg which was such an awesome prof!"}, {"id": 56, "review": "I have a love-hate relationship with stat, but it was pretty cool towards the end. I'm not good at counting, otherwise I enjoyed the other content we did, except for Indicator variables. If you study hard and read notes (especially do Prof Nagham's questions ) you can get a good grade."}, {"id": 57, "review": "I really liked the content in this course, although slightly too computational for my taste. However, the course is very intuitive, at least for the first half, so if intuition is your thing, then expect to do a bit less work."}, {"id": 58, "review": "The interpretation of this course is very mixed between people. Some people find it extremely easy to get a 90+ on, while others find it extremely difficult and barely pass. Probability seems to be more intuitive for some people. It's quite different in thinking compared to other math courses before it. If you work extremely hard, you can still achieve a good mark in the class even if it is unintuitive. Some people will say the start of the course is the toughest part since counting can be difficult and the course becomes more formulaic in the second half. Others say it only gets tough in the end. Overall, there are a lot of mixed opinions about each aspect of this course. I found the course to be quite challenging and enjoyable."}, {"id": 59, "review": "Fuck this course. It was just a complete drag."}, {"id": 60, "review": "Easy until the final, but the final was nothing like the sample finals so it hit hard. Take it with Diana if you can."}, {"id": 61, "review": "Really didn't like how the tutorials were only there to give you more tests instead of practising problems."}, {"id": 62, "review": "Great for exam p"}, {"id": 63, "review": "If you are good with combinatorics, it's the perfect difficulty and engagement at the beginning of the course. As soon as chapter 5 begins, it becomes more like knowing how to plug numbers into a formula rather than understanding the concept itself."}, {"id": 64, "review": "Easy for the most part till the end of the course which gets a little hard. Practice a lot and you should do well as all exams are quite fair."}, {"id": 65, "review": "long and hard"}, {"id": 66, "review": "easy to pass but the course is so annoying, it was hell on earth."}, {"id": 67, "review": "After I took Stat 231, I found this course is the easiest course in my life....."}, {"id": 68, "review": "So fucking boring, the prof didn't help the excitement factor either."}, {"id": 69, "review": "fuck this course."}, {"id": 70, "review": "Purely computational, should be an easy class if you keep up with the work, all assessments were really fair"}, {"id": 71, "review": "5/7 would take again"}, {"id": 72, "review": "Practice a lot. Little memorizing which is nice."}, {"id": 73, "review": "Good introduction to probability. The course itself can be very confusing at times, as probability is such a different beast than most other mathematics. Course is pure computation. Keep up with the material, as there are no assignments, only three quizzes."}, {"id": 74, "review": "I hate this course"}, {"id": 75, "review": "this course is so fucking boring holy shit. I hate my prof."}, {"id": 76, "review": "Pretty good."}, {"id": 77, "review": "Make sure to do all the practice problems. They're essential for success! I felt as if the course organization was lacking though. Spent way to much time on counting arguments and not enough on the last few chapters."}, {"id": 78, "review": "The lack of assignments is very welcome although there are a lot of tests. The first half of the course is very easy if you've taken data management in high school."}, {"id": 79, "review": "Very useful course!"}, {"id": 80, "review": "Meh"}, {"id": 81, "review": "I found this course very enjoyable. First quarter or so is High School Data Management review (counting techniques, basic probability etc.) Then it gets interesting. First midterm was really easy, second was tough and the final was somewhere in between. No assignments but tutorial tests every four weeks to make sure you're keeping up with the Material. Course Notes were fantastic with lot's of practice problems!"}, {"id": 82, "review": "Kind of boring until the end."}, {"id": 83, "review": "There aren't any weekly assignments which ironically is worse than having them. Make sure to do the assigned problems and you'll pretty much breeze through the course. Tests/midterms aren't very bad. Can't say that this is exhilarating material, though."}, {"id": 84, "review": "Starts out pretty easy, then it gets kind of confusing in the middle, and really confusing near the end."}, {"id": 85, "review": "STAT230 is so easy. It's astronomically easier than STAT240."}, {"id": 86, "review": "Practice."}, {"id": 87, "review": "This is a pretty cool course. I found it to be really interesting. I found the first two units to be challenging but everything else was pretty easy. As a result, the first midterm was tough but none of the other assessments were."}, {"id": 88, "review": "Took this on my non-degree term switching into the Math Faculty. Not an easy course for everyone - you will probably need to put in a reasonable amount of effort if you want to do well in this course. The material, however, was very interesting and applies a lot to actuarial science (which I am switching into) and I really enjoyed the material a lot! A lot of it is math-heavy so be prepared for that..."}, {"id": 89, "review": "Do not skip class and you will do fine"}, {"id": 90, "review": "I didn't like the course at all, but I had to take it due to its being a requirement. Passed it even better than I though I would though."}, {"id": 91, "review": "Pretty Interesting. Overall the course was okay. Loved the distributions. First midterm was decent, second midterm was a joke but the final was really hard."}, {"id": 92, "review": "The second half of the course was much more interesting than the first"}, {"id": 93, "review": "Easiest second year MATH/CS course."}, {"id": 94, "review": "Generally an easy course."}, {"id": 95, "review": "Really interesting stuff. Everything was easy except the final."}, {"id": 96, "review": "Good course, needs assignments!"}, {"id": 97, "review": "covers 60% of exam P, not bad."}, {"id": 98, "review": "Good course, not difficult, keep with the lectures and you'll be fine"}, {"id": 99, "review": "well, it's mandatory, and I would say it's OK. you need those ideas to go on with your CS career, but I don't think it matters as much as other courses. but again, it's mandatory, you have to do it."}, {"id": 100, "review": "If you want to do well in Stat 231, you need to understand the latter part of the course well. Stat 231 builds on a lot of the variances, standard deviation, distributions stuff."}, {"id": 101, "review": "Only trick questions. Doing the assigned material doesn't guarantee you'll do well in this course."}, {"id": 102, "review": "Easy course. However since there are no weekly assignments (at least in my semester) it is easy to get out of practice fast. I had this problem as it was easy for me to neglect this course, with the lack of graded assignments. There are tutorial questions, but it's not graded. I also didn't attend many of the lectures, my studying was mainly from the book and youtube. With better work ethics, this class should be a breeze."}, {"id": 103, "review": "such a easy course in all of my course selection"}, {"id": 104, "review": "Lectures were not helpful. Read the entire textbook and go to tutorials and you should pass."}, {"id": 105, "review": "Course is hell if you don't keep up. I found it intersting though."}, {"id": 106, "review": "Interesting examples provided in class. Quizzes, midterms and finals were rather harsh though, and it feels like that there was a significant mark \"adjustment\" at the end. Warning: no assignments are provided, so you need to keep up independently."}, {"id": 107, "review": "Half is a review of Data Management. Pretty straightforward. Covers topics from P exam except for some bivariate and calculus stuff."}, {"id": 108, "review": "I found it easy, but that was partially because they kept belling it up because a lot of people failed."}, {"id": 109, "review": "This could be an interesting course, however my instance of it was quite unnecessarily difficult. Beware, it is somewhat important for STAT231"}, {"id": 110, "review": "Useful, but gosh did I hate it. Not enough homework - hard to get good at stuff without practice."}, {"id": 111, "review": "Really liked this course, basic stats with some fun application. Very intuitive course"}, {"id": 112, "review": "Interesting second year course. If you go to class and do all the problem sets, then you should do well in the course."}, {"id": 113, "review": "Starts out easy and then gets quite hard later on. Keep up with the work if you want to do well."}, {"id": 114, "review": "Poorly taught; little support. Midterms and exam were difficult; the grade will likely have to be curved in the end."}, {"id": 115, "review": "Interesting course, although escalates pretty quickly towards the end. Consistent practice and it shouldn't be that bad."}, {"id": 116, "review": "This course is supposed to be easy, but you really need a good prof to make it so. There are too many terrible profs that teach this course and make it overly complicated."}, {"id": 117, "review": "Course is very useful, and is filled with people from numerous programs. It can get a bit difficult if you never studied probability before in high school."}, {"id": 118, "review": "Easy, not much work."}, {"id": 119, "review": "Great course, just go to class!"}, {"id": 120, "review": "Could've been useful, I suppose."}, {"id": 121, "review": "The first midterm is a review of high school data management. The second midterm introduces new concepts and the final is usually pretty tough and is very heavy on the material in the final few weeks, which I'm not sure I even understand today. All in all you can do well if you pay attention and benefit from the bell curve at the end of the course."}, {"id": 122, "review": "Up to first midterm was easy, then it got bad..."}, {"id": 123, "review": "Course could've been useful. Prof ruined it"}, {"id": 124, "review": "Pretty much the entire course is about random variables. The content gets a bit dry after awhile."}, {"id": 125, "review": "I found lectures to be too qualitative or too focused on proofs, so they didn't prepare us for the midterms and final exam."}, {"id": 126, "review": "Easier than your high school data management and probability class. For some reason so many students did poorly that the final grade was scaled by over 30%... but really I could have gotten a 100% without scaling while I was in highschool. Probably the easiest class I've taken, and that's including ARTS electives."}, {"id": 127, "review": "Midterm was beyond difficult, class avg 36%"}, {"id": 128, "review": "Study."}, {"id": 129, "review": "the course itself is OK, but the prof (Changbao Wu) sucks"}, {"id": 130, "review": "Not the easiest intro courses but it was fair."}], "CS 245": [{"id": 0, "review": "\"Instructions for the IAs Please remind the students: The course will become more challenging, soon. Be prepared to put in more time, if needed\". I guess I somehow only have 1 course this term."}, {"id": 1, "review": "Fun but not sure it's very useful."}, {"id": 2, "review": "hate this course, wouldn't recommend taking it unless it's a required course for your major. don't think it'll content will ever be useful in the future :/"}, {"id": 3, "review": "WORST COURSE EVER!!!!!! Tedious, LOTS of materials to read, and super hard! I would never take it if it's not one of the major requirement!!!! Those proofs are tedious and strict, and you'll never know which part of your solution that the graders will think is trivial or worth 5 points! I haven't been to any lecture after midterm since I clearly realized that spending hours sitting in the classroom listening to things I can hardly follow is such a waste of time. Instead, I just looked at the provided course slides and tutorials and I got 90+ on each assignments! Midterm and final exams were super hard! Too many questions and too little time!"}, {"id": 4, "review": "\"The first half of the course is trivial\", or so I heard. Picking up concepts is kind of difficult at times, because the course content sometimes makes you try to do the assignments without knowing exactly how concepts should be applied. It takes some practice getting used to it, but once you look at tutorial examples and slides things do start to clear up."}, {"id": 5, "review": "the course notes and lectures are horrendous for this course. notes were all slides which are like 50% filler. the lectures just involved prof reading those same \"course notes\". i even like writing proofs but the course is so difficult to get through on account of being so bloated and boring. its not even hard its just presented poorly"}, {"id": 6, "review": "UW CS's way of overkill-preparing you for writing if-statements at your co-op. Starts out easy with MATH 135 review but ramps up significantly. Logical equivalences, formal deduction will kill your brain, and by the end of it you'll eat De Morgan's laws for breakfast. 3hrs of videos a week during COVID that I played on 2.5x speed while hugging my stuffed dolphin and crying into it because it was so boring."}, {"id": 7, "review": "please remove it from required courses for cs in the future"}, {"id": 8, "review": "My first mark below 90 in a cs course. The profs could not be more monotone (worse than Brian Forrest). I got a 92 on the midterm and a 70 something on the final. Ended with an 86. I have not heard a single person say anything good about this course, but I'm going to go against the grain and say that the first half (formal logic) was pretty easy and interesting. The second half, though (turing machines and undecidability) made no sense. Don't see how this class is useful at all, though."}, {"id": 9, "review": "I had Jonathan Buss. Man put me to sleep in every lecture, no matter how hard I tried to pay attention. If you have Pablo's office hours, definitely attend them, they are so helpful for the assignments!! Pablo is the reason I passed this course, not Buss and his multitude of slides."}, {"id": 10, "review": "took it with Jonathan Buss (aka the Worst Prof at Uwaterloo). since it is a required course for CS students, don't waste your time taking the course with Jonathan Buss, instead take it with some other prof."}, {"id": 11, "review": "Pretty awful course. The content is kind of interesting but useless, and the assignments are not too difficult once you do some practice and properly go over the slides. Tutorials/Office hours can be very helpful if you go to the right person, some of them are literal bots, but others are extremely helpful like Pablo and Dheeraj. BUT THE EXAMS ARE SO HARD. The questions are similar to assignments but 10x harder and longer. Final tore me a new one."}, {"id": 12, "review": "Lot of proofs to write. Not sure why it's useful for cs students tbh. looks like most of the content would be good for math students instead"}, {"id": 13, "review": "This class is like you took MATH 135, and threw it in a blender, along with a bunch of other new concepts. A lot of the material presented seemed pretty interesting, however useless. Also, the first half of the course with propositional and first order logic was not too hard. However, everything after that was really hard to understand, like turing machines, and weird formal deduction proofs. Also, the instructors did not respond often to Piazza questions and gave very vauge answers oftentimes (usually just yes/no answers). I do have to give a shoutout to professor Kari, as her lectures and commentary were really fun and were honestly my main motivation for getting through this course."}, {"id": 14, "review": "Surprisingly difficult course due to the style of delivery. Really sharp escalation in difficulty in assignments, and midterm was unexpectedly difficult. The proof methods used were a little hard to get used to, and the biweekly assignments actually took a while. Overall caught me by surprise for a course that was just supposed to be tedious. Big shoutout to prof. Roberts for having the best office hr and being patient despite some very very interruptive questions from certain students."}, {"id": 15, "review": "The worst course I have taken at Waterloo so far. The course wasn't bad because of its content or difficulty. The reason why this course was so terrible was because of its delivery. Students had to read between 100-150 slides from a powerpoint each week. Reading text from 100 uninteresting slides is just painful. I found the course difficult at first because the slides made the simplest concepts hard to understand. I already knew a few of the CS245 topics before this course and I still had a difficult time figuring out what the slides were trying to say. The course got much easier after I gave up on the slides and started googling videos and articles to learn from instead. I did take this course during the pandemic, so hopefully it will be a little better in person."}, {"id": 16, "review": "No help or explanations, online COVID course in fall2021"}, {"id": 17, "review": "so useless, but pretty interesting?"}, {"id": 18, "review": "Took it online and it was the worst course I've taken in my life. With 100+ poorly organized slides to read per week (alternatively, you could watch someone read off the slides word-by-word at 30 words per minute), the content delivery was abysmal. The content itself was sometimes interesting (particularly Turing Machines & program verification in Week 12/13) but brain-numbingly boring for the most part and insanely useless, which made the course 3 times harder (most people had 0 motivation for this useless course). The course staff were also just as useless as the content; Crowdmark assignments usually didn't have any feedback and marks were deducted for no reason whatsoever. While Zihao Wang responded to each Piazza post very quickly, his answers were useless cause 99% of the time because he didn't care to understand the question and just wanted to type something in the instructor answer. In summary, this course was a huge waste of time and the delivery was terrible (course staff sucked). My one piece of advice is to study hard for the exams as they were very difficult timewise. Good luck. Update: You'll need the content in CS245 for CS251 and CS241 so make sure you're learning."}, {"id": 19, "review": "Honestly, the course itself is quite interesting. It's just the overall structure of the assessments and the grading schemes being kinda unreasonable."}, {"id": 20, "review": "The most difficult and disappointing course I've taken so far in my undergrad. The content is taught poorly with a lack of examples and insights that truly reflect the difficulty and intuition present on the written assignments and assessments. The only way you're going to get a high grade in this course is if you let it become a time sink - allocating many hours per assignment, going to every office hour, and going to every tutorial. However, this course isn't even that relevant for many students pursuing a CS degree here. The fact this course needs to become a time sink if you want to do well is a testimony alone to not just how poorly taught this course is, but how poorly designed this course is."}, {"id": 21, "review": "Like some other reviewers said, you need to respect the difficultly of this course. In hindsight, if you study well, go to office hours for assignments, and really ensure that you understand each new topic introduced, you should do reasonably well."}, {"id": 22, "review": "The course itself is not that bad. Some parts of it are even useful and fun. However, the professors of this course and its structure is a dreadful recurring nightmare."}, {"id": 23, "review": "No one likes this course. It's unnecesarily complicated and tedious for students. The instructors lacked any enthusiasm for the content. 3 marking TAs left for some unknown reason as well. I really don't think anyone likes this course."}, {"id": 24, "review": "Interesting course.... but useless lol"}, {"id": 25, "review": "I took this course only during the pandemic. It is poorly organized and the assignment and test questions are either very easy, or extremely difficult. This is defiantly a borderline Math course as 95% of the course revolves around proofs. Personally I dislike most of the contents taught in this course (the Turing machine part is a bit more interesting, but the assignment question is on a different scale compared to what was taught), but I think it is because of the way this course is taught. Each week there can be up to 200 or more slides to read and the lecture videos barely covers any contents. The course becomes boring and exhausting. This is the hardest CS course I have taken so far and I suggest taking it in person if possible."}, {"id": 26, "review": "Not as easy as I have heard. Went in expecting a breeze but got hit hard by the Buss like the other commenters. However, if you study well and respect the difficulty of the course (unlike me) you should get high grade. I can't really see how learning this material would help me in my future CS courses or in the industry. I saw this course as nothing more but a required course needed to complete for my degree. Although the section on Godel's Incompleteness Theorem did intrigued me enough to watched Veritasium's video on it, this course sometimes felt like a waste of time to me."}, {"id": 27, "review": "Great course. Excellent lecture materials, which have no mistakes in them. Instructors are very responsive on piazza. Assignments are reflective of examples presented in tutorials and slides. Timed midterm and final exam was easier than untimed weeklong assisgnments. The final exam especially was trivially easy compared to everything else in the course.................. Jkjk, everything I said above in the opposite order. The final exam was brutal, my mark dropped by 7-8 percent. I got hit by the BUSS."}, {"id": 28, "review": "There are some useful concepts, like proving whether some program works or not, and the stuff with Turing machines, but so much stuff was useless in my opinion. Also exceptionally hard for no reason. Must attend office hours or doing the assignments is not really possible unless you are amazing at proofs."}, {"id": 29, "review": "This course is so useless, making us take this should be considered a crime"}, {"id": 30, "review": "Although this course is overall useless, I enjoy the part where I actually designed a turning machine. Also, the course is relatively easy, and most people I know are about to ace the course (I predict I will get a 96 or something)"}, {"id": 31, "review": "Homework marks were often taken off for pedantic reasons. The problems themselves were often very tedious."}, {"id": 32, "review": "This course makes 0 sense. Every lesson is a poorly explained 100+ page long pdf. There was a lesson that was 80 pages that didn't make sense and was better explained by a single Wikipedia picture. Everyone I know gave up on trying to understand the course after the midterm. Details about the final exam were on a follow-up comment to a buried Piazza post of someone who asked for the details (wasn't even pinned). 1/2 way through the final exam they start posting about critical errors in the exam questions."}, {"id": 33, "review": "I hated this"}, {"id": 34, "review": "A very poorly run course (took it during covid-19) with assignment questions that are both stupid and easy (stupid, because it's not rewarding, easy, because it's straight from the slides). The exams were a bit more difficult but still trivially easy (except maybe formal deductions). The course content must be revamped since the slides are notoriously long."}, {"id": 35, "review": "Took it online during a COVID term, weekly assignments and take-home exams. Assignment difficulty comparable to 135, can be done just by reading off tutorials and slides."}, {"id": 36, "review": "pretty much an extension on 135 lecture videos were very lengthy (~40 per video, ~5 videos per week) with the prof mostly just reading word by word off the slides"}, {"id": 37, "review": "Taking the course during covid (F20), its not well organized by the profs, the content is moderately uninteresting (maybe that's just me), and the profs don't seems to care about applications (understandable if its a math course, but this is \"CS\"245)"}, {"id": 38, "review": "This course is not all that bad if I am being objective. The content for propositional and predicate logic is actually interesting. Things do somewhat go off the rails with Peano Axioms and Program Verification. The main issue with this course - mainly just for this term (and potentially next term) - was the disorganization. The slides were quite long, and also quite dull in terms of explanations. Some had very few (useful) examples, and others had nothing but examples. The only \"lectures\" we had were a few short 2-5 minute videos about particular slides where they typically just went over the example on the slide, or maybe added in some additional information for said slide. I felt the course lacked effective explanations due to the medium for communication, which actually made our midterms and final somewhat difficult. The proofs in this course actually weren't all that bad, and to an extent I would argue were easier than Math 135. I guess it was because they were much more focused in terms of content, and not as abstract as 135. Just remember... YouTube is your friend!"}, {"id": 39, "review": "Terribly organized, had to teach myself the whole course. While the concepts aren't too difficult, there was no adherence to deadlines, course materials were all over the place spread across 5-10 separate slideshows every week. No information was given about our final until the very beginning of final season. Overall, don't take it online if you don't have to unless youre confident in teaching yourself everything and doing it on an unknown and tight schedule"}, {"id": 40, "review": "A Formal Math135 but without fun."}, {"id": 41, "review": "Online Course: Lectures are painfully short videos x 100, notes are slide PDFs with all the extra animation slides (they couldn't be bothered to take them out), and they updated A1 on LEARN two times after releasing it without making announcements to the class, only a reply to a question thread on Piazza (which isn't even the A1 official post). This review is from the beginning of week 2. Pray for us"}, {"id": 42, "review": "Incredibly boring and dry course. If it weren't for Professor Alice Gao's online notes and problem sets, this would have been a lost cause. Midterm was easy and the class did super well, and so they made the final ridiculously long and difficult to pull down the average. They succeeded :("}, {"id": 43, "review": "Propositional and predicate logic will definitely come in handy in later courses, but there's not a whole lot of interesting material. Doesn't help that our term skipped Program Verification entirely."}, {"id": 44, "review": "Terribly organized, with big inconsistencies from prof to prof. The material in theory should be exactly the kind of thing I'm into, but the amount of poorly-defined course-specific terminology really threw me off."}, {"id": 45, "review": "Fun course if you like doing proofs. Can be bad if you don't. Practice a lot and make sure you go to lectures."}, {"id": 46, "review": "Fantastic with Alice Gao, content was interesting and everything made sense, not alot of work."}, {"id": 47, "review": "Worst course I've ever taken. MATH 135 on steroids, but nowhere near as useful."}, {"id": 48, "review": "Not extremely easy but definitely easy for a CS course. The assignments are super useful and are pretty much all that's needed to do well on the midterm and finals. The content is interesting but not really applicable. A major downside is that often what is asked to do is not really understood but rather just memorized in order to be able to regurgitate it. Careful at referring to previous years though because the curriculum is always changing."}, {"id": 49, "review": "The course was pretty simple throughout the term. Some of the assignment proofs were fairly challenging, but they were enjoyable to complete. Towards the end the course got a bit more grindy, with program verification and whatnot, but overall a good course if you ignore its usefulness."}, {"id": 50, "review": "Was not a fan of this course at all. Thought it was extremely boring and pointless. Do the assignments and you'll be good to go. Sad times."}, {"id": 51, "review": "Really interesting course that changes the way you think!"}, {"id": 52, "review": "Trash useless course, gg,"}, {"id": 53, "review": "Took the enriched version. From what my friends in the non-enriched version were doing, this was not a mistake. The enriched version really brings an appreciation for strongly typed programming languages, and the power of a type system."}, {"id": 54, "review": "Useless but fun"}, {"id": 55, "review": "Makes no sense. No idea what I was doing on assignments or on exams."}, {"id": 56, "review": "not useful, midterm is really easy, but after midterm is pretty boring."}, {"id": 57, "review": "Worst course in Waterloo; should be removed completely. The difficulty picks up fast after the midterm. I ended up submitting remarks for 9/11 (no pun intended) assignments cause markers will just take off marks for anything."}, {"id": 58, "review": "Fuck this course. If you want to take it in an easy term, make sure Trefler is teaching it. There will be no solutions provided for the midterm/final/assignments, and none are provided to the markers. You can write a bunch of bullshit on the page and get an easy pass without learning jack shit. Just make sure your bullshit is sensible and has random words that have been said in the course."}, {"id": 59, "review": "Boring, but not a hard course"}, {"id": 60, "review": "There could have just been a logic unit in some other CS course"}, {"id": 61, "review": "Practice a lot. Hope your teacher doesn't screw you."}, {"id": 62, "review": "I took the enriched section of the course with Prof. Ragde. I can't say much about it since it's still a curriculum in dev. We did a lot of programming however, which is not something the standard sections usually do."}, {"id": 63, "review": "The material COULD be interesting. The course was one of the most horribly taught I've ever seen. I went from a 59 to an 80 on the midterm after being remarked. We were literally NOT TAUGHT something on the midterm. Just try not to fail, because then you'll have to do it again."}, {"id": 64, "review": "Boringest course ever"}, {"id": 65, "review": "The course itself was pretty simple - they'd define a method to solve a set of problems, you memorize said method and apply it. Not very interesting or useful, there were only a few things we learned that I actually could appreciate and see the usefulness of, like program verification and some stuff on code simplification."}, {"id": 66, "review": "I was in the enriched section and the entire time I thought I didn't actually understand what I was doing and thought I would get a low mark, but then ended up with a 100%. For at least the enriched section the tests are way easier than the assignments and class examples."}, {"id": 67, "review": "This is definitely a great and useful course to take. Try to think more, not only focus on solving the questions."}, {"id": 68, "review": "It was not cool beans"}, {"id": 69, "review": "Very interesting but it's only really useful for mathematical maturity purposes."}, {"id": 70, "review": "An interesting and easy course, assignments didn't take too long and the proofs (from resolution to natural deduction to program verification) were like fun little puzzles. Keep up with the assignments and you will do fine :)"}, {"id": 71, "review": "Found it very interesting and easy to understand, though I know many people who would disagree."}, {"id": 72, "review": "Wasn't such a bad course this term. The content for propositional logic was pretty interesting actually. Course started ramping up at predicate logic, and got pretty boring honestly. I don't really care about soundness and completeness. Though if I had to compare this with MATH 135, this course is definitely better. The proofs you do aren't really the same nature, so if you hated 135 then at least this course isn't any worse."}, {"id": 73, "review": "There were only two profs in this term, and neither of them taught this course well, and made this boring course even more boring."}, {"id": 74, "review": "The enriched version of CS245 is definitely worth taking, and it's more of a PMATH course rather than a CS course"}, {"id": 75, "review": "Boring material."}, {"id": 76, "review": "This course has terrible structure and planning. I feel like the extremely subpar instructors and coordinators along with the terrible selected material ruined this otherwise interesting course..."}, {"id": 77, "review": "Not a good course, very hard. It is completely useless/boring/pointless for CS people. Midterm was very bad but the final was OK. I narrowly passed. Keep up to date with the lecutures and try to understand the concepts thoroughly and you can do it."}, {"id": 78, "review": "Some prof is hard, some is easy. Course hardness really depends on prof."}, {"id": 79, "review": "A necessary evil that I hope will become more interesting in the future."}, {"id": 80, "review": "They should learn from http://en.wikipedia.org/wiki/Coq And princeton: http://www.cis.upenn.edu/~bcpierce/sf/current/deps.html"}, {"id": 81, "review": "awful course. terrible textbook"}, {"id": 82, "review": "even if the idea of this course is brilliant, I admit, but this is the only course I don't want to see on my checklist so far."}, {"id": 83, "review": "The material is quite dry. Lot of theory-based stuff which I didn't really like. A lot of the proofs for theorems were quite unnecessary in the course as you'll most probably not understand them and if you did, you're going to forget them in a couple of weeks/months anyway. It did teach a lot of logic stuff which could be kind-of helpful for future courses. I expected some programming but there was not a single line of code."}, {"id": 84, "review": "The content was too abstract and the assignments were uninteresting. Program verification was OK, though."}, {"id": 85, "review": "Very messed up course. Open book midterm does not make it easy."}, {"id": 86, "review": "Don't expect too much utility out of this class. The proof systems are sort of neat, it's challenging enough. Unfortunately we all need to take it, hope they change the format soon."}, {"id": 87, "review": "Really disorganized and hard course"}, {"id": 88, "review": "My favourite CS course at Waterloo. Lectures were horrible and extremely dry. The midterm should have been really simple (had I studied properly...), but the final was quite a bit more difficult. Overall, I really enjoyed the material and was pretty impressed with how much more interesting logic is than math (CS 245 >>> Math 135)"}, {"id": 89, "review": "Quite difficult, despite the open book examinations. Course is subjective based on your professor."}, {"id": 90, "review": "do not take this in the fall term"}, {"id": 91, "review": "I don't really see how I will use this course, you can't do a formal proof for every program you write. And if you did you wouldn't limit yourself to not using certain rules just because."}, {"id": 92, "review": "I loved the course, hated the prof."}, {"id": 93, "review": "50/50 depending on prof. If you get stuck with a bad prof (eg. buss or toman), you are going to absolutely hate this course."}, {"id": 94, "review": "Pretty hard course"}, {"id": 95, "review": "Go to class, tutorials, and do the assignments."}, {"id": 96, "review": "it's math..."}, {"id": 97, "review": "Good, go to class, do assignments, open book midterms"}, {"id": 98, "review": "Tough course. Lots of people failed, didn't see any use for it in future terms."}], "MATH 127": [{"id": 0, "review": "Taking the course right now and it is pretty difficult. The content itself seems easy and understandable, but when you have to complete the tutorial quizzes it's the opposite. Mobius lessons and actual lessons aren't the best for studying for the tutorial quizzes, you have to do some of the optional textbook questions and extra practice problems if you want to decent on the quizzes. This course was more difficult than I expected."}, {"id": 1, "review": "Super easy course. Did not spend more than 2 hours on this course each week. However, the flipped course structure was not handled well, the lectures were pretty much useless."}, {"id": 2, "review": "Should be a straight shot if you did well in high school calc. Bare effort finished with high 90s."}, {"id": 3, "review": "Love love love Calc! If you did great in high school, you will do great here since the concepts are kinda similar."}, {"id": 4, "review": "Useless lectures, but incredibly easy assignments/tests."}, {"id": 5, "review": "if youre getting like a 60 in first year just finish with it and get it over with if you really need it, first year isnt really looked at for grad schools anyways. class doesnt really teach you anything you learn online with mobius. the class average was kinda sucky but it is what it is."}, {"id": 6, "review": "(COVID-19/ remote learning expérience:) This course is essentially grade 12 calculus along with integrals at the end. The content is taught at the university level, so don't expect highschool-level explanations. The lectures involved more rigorous definitions and more involved problems than you would expect in a high school course. If you got 95% in grade 12 calculus, you pretty much know all the concepts and only need to worry about developing your skills further with this course. Integrals are not in the Ontario curriculum, but if you have time over the summer, you can definitely teach it to yourself by searching waterloo's free OpenCourseWare with this link: https://courseware.cemc.uwaterloo.ca/"}, {"id": 7, "review": "Took this course online due to COVID-19. MATH 127 starts off with very simple content by first covering the basics of functions, which should've been covered in grade 11. It then moves into limits and derivatives which is covered in grade 12. Finally, the course ends with integration, which should be the only new topic that is presented in the course. Essentially, around 3/4 of this course is covered in high school with a little more toughness in the test questions. I personally found this course to be on the easier side but it gets confusing at the end of the term with the new integration content. A few tips for this course is to do the practice midterm and exam problems that are provided, it is highly likely that a question or two from the practice problem sheet may show up on an assessment, or a question very similar. Attend office hours if you are confused. University math can be a big jump for people and topics can be hard to understand, which is why asking your professor/TA is the best option to clear up any confusion and will only benefit you in the end. Overall, this is a useful course and is relatively easy to begin with. It will prepare you for what you should expect in MATH 128, if you take that course."}, {"id": 8, "review": "I wouldn't worry too much about this course lol. First two units are basically gr 11 functions and gr 12 advanced functions, 3 & 4 are gr 12 calc and 5 is the only new concept which is integration. i wouldn't even say it's that bad. just study before the tests, but if you know how to do limits and derivatives you'll probably be fine."}, {"id": 9, "review": "Grade 12 calculus was harder. Just pay attention and study a decent amount to do well. I think it has been adapted online well and tests your knowledge fairly"}, {"id": 10, "review": "The tests are nothing like the practices or the learning modules. goodluck."}, {"id": 11, "review": "got a 91 but still the expectations of TA while grading were unreasonable"}, {"id": 12, "review": "If you took Advanced Functions and Calculus in high school, this course is an exact repeat except you learn integrals at the end. If you took AP Calculus, you learn more in high school calc than you do in this course. The midterm is a little tough, but the rest of the course is a breeze. The final exam was easier for me than the midterm."}, {"id": 13, "review": "This course was really easy and light aside from the assignments and projects. There wasn't a midterm or final but that was because it was made into an online course due to COVID so I'm sure it'll be different once things get back to normal. Overall, there were just a bunch of quizzes at the end of each lesson and bi-weekly assignments with limitless attempts which, were to help make sure you understood the lectures. There was also a practise midterm to test yourself and a journal to keep yourself on track. Overall the course was pretty easy as it was just a repeat of grade 12 calc with one additional unit on integrals at the very end. The online video lectures, however, were almost incomprehensible. It took so long to understand, your better off referring to free textbooks online or searching up concepts on youtube. I only used this for the integral lecture but if you didn't take calc in grade 12 you should probably make sure to do so just to ensure you understand concepts completely. The projects were a little tricky but the prof replies pretty quickly during office hours with hints and tips on how to approach the question. Everything was pretty enjoyable except for the video lectures."}, {"id": 14, "review": "High school math stuff review, functions, derivatives, integrations..."}, {"id": 15, "review": "Basically advanced functions up until the midterm, then grade 12 calculus after that. A bit of integration is taught at the end, but overall very easy course."}, {"id": 16, "review": "Easy course. I found the entire course review of Grade 12 Math and Calculus. I know that for Ontario students didn't learn Integrals so the last month-ish will be a little harder for you but people who have done integrals y'all good."}, {"id": 17, "review": "having done AP calculus in high school, this course should have been a breeze, but i was surprised as to the fact that is wasn't as easy as i thought it would be. content wise, it covers all the functions done in high school, limits and derivatives, and an intro into integration. the midterm was quite hard and the profs had to propose an alternate grading scheme to help students from a poor performance, which had an average in the 60s. florian girelli is great at explaining concepts and makes sure his students know what typical \"traps\" students normally fall in on midterms and exams and how to avoid them. however, he does go quite fast in the notes and it seems as if you are expected to know the content before hand, but not everyone does. he does have a lot of clicker questions in the lecture to practice the math. the final was fair and if you practice the final exams given from previous years, it is very similar to those."}, {"id": 18, "review": "Don't fall behind! Starts with review from high school and the end is full of integrals and such."}, {"id": 19, "review": "Not that bad, unless you fall behind (which occurred more quickly than I would have thought)."}, {"id": 20, "review": "Most of the course is just high school math. If you are good at math, this course moves pretty slowly. However, the content is extremely clear and thorough."}, {"id": 21, "review": "really easy, pretty much high school calc"}, {"id": 22, "review": "Mostly a review of high school calculus, except towards the end with integration. EoLs are very effective practice."}, {"id": 23, "review": "Don't fall behind on this class. And don't have Puneet Sharma as an instructor. A lot like 4U Calculus and Vectors, but integration is added. Focus on implicit differentiation."}, {"id": 24, "review": "Lot's of high school review with some added information. I have never been a fan of math courses, but Brian Ingalls definitely made it more bearable. Tutorials go over practice problems with TA's and are usually uploaded to learn, so I never went. Easy to get over 80."}, {"id": 25, "review": "About a month of highschool review (functions) and the rest was derivatives and a bit of integration. If you took AP Calc. in highschool, this should be very easy for you. If you haven't done integration before, it's important to learn and understand it when it's taught to you in class, because you will do more of it in MATH 128. *Highly* recommend taking this course with Paul McGrath or Owen Woody. I had Paul for 127 and Owen for 128 and both did an incredible job teaching the content, plus they are the course coordinators. Make sure to do the Mobius assignments for the free marks. They are sometimes frustrating / annoying to do, but hang in there! If you keep on top of your work, it is easy to get a good mark. :) They are also incredibly kind to us in this course, because we could make our own cheat sheet for the midterm and final, and were allowed to use any calculator that wasn't able to do derivatives or integration (didn't have to be faculty approved ie pink tie, blue goggles, etc.)."}, {"id": 26, "review": "Took the in-class version. 5% mini assignments, 10% biweekly assignments, 15% projects (should be a free 30% at this point), 25% midterm, 45% exam (becomes 70% if better than midterm). Also, they let us bring cheat sheets to midterm and exam. Midterm was easy, exam was kind of hard. Based on the generous marking scheme, it shouldn't be terribly difficult to get a decent mark. They definitely made the course easier compared to previous years, from what I've heard."}, {"id": 27, "review": "Took this course online. Owen Woody and Paul McGrath did a reasonable job with the online lessons --- though sometimes the examples go into more detail than necessary in my opinion (when strapped for time, use the formulas from the lessons (view the lessons in slide mode -- button in top right) and do the online mini - and bigger - assignments). Do all the little online homework assignments; the cumulative effect is enormously important to learning the material and the grades add up. No midterms; two \"Crowdmark Assignments\" which serve as take-home tests instead. The final exam is, unfortunately, worth 50% of your grade; this really pulled my grade down (they gave good practice problems in preparation for the exam, but I tend to make lots of silly mistakes in math.)"}, {"id": 28, "review": "Failed this course, keep up with whats going on in class because before you know it the final exam will come around and you'll be completly lost."}, {"id": 29, "review": "High school calculus + VERY SIMPLE integration. Very rather easy imo."}, {"id": 30, "review": "Essentially a review from Grade 12 Calculus. Required minimal effort. Just do the worksheets and if you do not understand, refer to the textbook."}, {"id": 31, "review": "Very similar to highschool calc if you did that. Basic. Only do integration in the last couple of weeks. You need to go to class in order to find out their expectations. Exam is straight forward. Tutorial is snooze fest, bring other school work to do."}, {"id": 32, "review": "Stay abreast with the work. Like all Math courses, this is the key to success. I strongly recommend Paul McGrath"}, {"id": 33, "review": "Coming from a bio student that hates math and did really poorly in it in high school and couldn't get their grade above a 60 the entire term, the exam is really easy as long as you study. The weighting is so exam heavy (especially if they drop your midterm) that your grade can easily jump up 20-30% if you do well on the exam (I finished with a mid 80). Do the textbook work and assignments and you should be alright. Tutorials are pointless, TA's don't know what they're doing. Profs aren't any better. Study groups are key to your success if you don't know what you're doing."}, {"id": 34, "review": "If you took grade 12 Calculus you should do extremely good in this course because most of the class is grade 12 calculus."}, {"id": 35, "review": "Basically like repeating grade 12 calc"}, {"id": 36, "review": "Keep on top of your stuff, mostly just review from grade 12."}, {"id": 37, "review": "This is a review and extension of highschool calculus, and if I had kept up with practice questions it probably would have been a lot easier. Strive to understand what you're doing rather than just memorizing exercises and problems!"}, {"id": 38, "review": "Simple course if you do all the practice problems and final exams from past years. Average is 60ish, but hard work makes this course manageable. 90+ is easily achievable if you put in the work."}, {"id": 39, "review": "This course is extremely fast paced. However, the quizes are fairly easy. It is possible to achieve above a 90% in this course if you keep up with the material and seek help as soon as you fail to understand a concept."}, {"id": 40, "review": "Basic calc course, going to class isn't necessary as long as you stay on top of assigned questions and the worksheets. Quizzes can be difficult if you haven't kept up on the workload. This is not an average boosting class, would not recommend taking it if it's not required."}, {"id": 41, "review": "Basic calculus course. If you do the homework and worksheets, you should have no problem on the quizzes and exams."}, {"id": 42, "review": "i like math, not a big fan of my proff, the work i found to be fun and relatively easy. need to work hard before midterm and exam. midterm went very bad, exam was fair. quizes are relatively easy after looking back at them, just lots of little mistakes everywhere"}, {"id": 43, "review": "Not even hard if you pay attention in class, mid-term was meh but they didn't count it if you did better on the final. 5 Bi-Weekly quizzes that were very straightforward and the final is literally the exact same format as the practice finals they give you."}, {"id": 44, "review": "Easier than highschool, easy 100 jk 97 not easy"}, {"id": 45, "review": "easy course as long as you go through the textbook"}, {"id": 46, "review": "I am the type of person who will never use calculus again in my life. I did not enjoy the class, and struggled to do well. The questions were difficult, and the course average was low."}, {"id": 47, "review": "This course was alright once you got the hang of it. I was not too confident about calculus coming into the course, but afterwards I did very well on the exam. I can only recommend practice with this course to do well in it. Also, the weekly quizzes were annoying but doing the assignments well ahead of time ensures that you have a good grasp on the material and that means it'll be fine."}, {"id": 48, "review": "A good calculus course but it goes incredibly fast. Definitely take the course with Woody, he makes it a lot better."}, {"id": 49, "review": "Pretty easy course - mostly the same as gr. 12 calculus. It's helpful to do the worksheets they give you as the questions on quizzes are really similar."}, {"id": 50, "review": "This course runs too slow in the beginning, covering things like limits and basic derivatives much too extensively. Then it speeds rather quickly through the stuff that counts- complex derivatives, integration, and their applications. Over-all good content. Difficulty really depends on how good your prof is, and how much time you are willing to put in."}, {"id": 51, "review": "The first half of this course is mostly review but after the midterm it gets pretty difficult and it is important to keep up with any practice questions assigned by your prof."}, {"id": 52, "review": "didnt even have to study, bird course"}, {"id": 53, "review": "Wasn't the easiest. Keep up with the assignments and do a lot of practice exams before the final exam."}, {"id": 54, "review": "When I took this course there were like 9 quizzes, 10 minute \"time limit\" during tutorials worth 40% of the final (only started W15, don't know if they kept it like this) but they were fairly easy. Do enough practice problems until you feel confident with the material. For the midterm/final they expect you to have some understanding of the theorems, and a strong understanding for rules/application type questions."}, {"id": 55, "review": "I came from a standpoint of having taken calculus in high school (including integrals) so for me this was almost entirely a review. But if you pay attention to the examples given in class, do all the homework, or look for other example questions online or something, you'll be okay. The exams were harder than any of the homework and practice questions though."}, {"id": 56, "review": "Make sure to do your assignments and read over the notes! Other than that, it will be pretty straight forward."}, {"id": 57, "review": "About half of the course was somewhat review from high school pre-calculus, so the midterm was relatively easy. A lot of the newer content was covered in the second-half of the course but it shouldn't be difficult if you keep up with the assigned work!"}, {"id": 58, "review": "I failed this course, lol. The assignments were really hard and I was way too stressed with adjusting to university this term -- maybe if I took it later on and actually knew how to manage my time, it would've gone better, but as it stands this class was hell for me. I should also add that I suck at math. If you're good at math, you'll probably be fine."}, {"id": 59, "review": "If you took calculus in high school this should be pretty straight foward course as you the only new stuff are probably like (implicit differentiation, L'hopitals, related rates, linear approximation and introduction into very basic integration) depending on your high school curriculum.."}, {"id": 60, "review": "Definitely a challenge towards the end, but very interesting"}, {"id": 61, "review": "If math is not your thing, avoid this class at all costs. I found the weekly assignments to be super difficult!"}, {"id": 62, "review": "Then end of the course it got a little hard but before that it was almost all review. Do the assignments and practice."}, {"id": 63, "review": "Over half the course focused on grade 11 and 12 functions. Assignments were much harder than the term tests. The midterm was harder than the final, but both were relatively easy."}, {"id": 64, "review": "Basic Calculus course, the first half of the course should be stuff you already know. Even if you don't, the course itself was pretty easy, exams included. The midterm wasn't too difficult but they made the final easier anyways. Also, don't let the insane assignments they give you affect your opinion on the course. They're only worth 1% each, the exams are what really matter in this course, and it's not even close."}, {"id": 65, "review": "Mostly a review of high school calc. If you've taken AP Calc in high school and learned integrals, you should already know everything in this course."}, {"id": 66, "review": "For the first three quarters of the class it reviews all the math from high school. The last quarter is antiderivatives and integrals."}, {"id": 67, "review": "Standard calculus course, meaning that it was pretty bland, black-and-white math. Mostly review from high school with the exception of integrals (unless you were in IB, AP, or some other advanced magnet program in high school). Mid-term is usually set to be somewhat difficult, but the exam is usually easier as a result."}, {"id": 68, "review": "This course sucks. Since it is a requirement for sciences, just go to class and pass with a 50 so you never have to take it again."}, {"id": 69, "review": "Do the assignment and u will b fine"}, {"id": 70, "review": "up until the midterm was highschool review. The course gets tough in the 2nd part of the semester."}, {"id": 71, "review": "Awful course since I hate math, but one of those you had to get through. Keep ontop of due dates for assignments and do the questions in the textbook for extra help. Sometimes TAs have no idea what they are saying though."}, {"id": 72, "review": "Very nice course but not as easy as I thought"}, {"id": 73, "review": "Don't think it has any relevance"}, {"id": 74, "review": "took it online, pretty easy but still calculus."}, {"id": 75, "review": "The course is almost a direct copy of high school calculus and advanced functions. Keep up with yourself and you'll do fine"}, {"id": 76, "review": "I'm not going to lie, this course was made a lot more awesome because of the prof."}, {"id": 77, "review": "takes a lot of work"}, {"id": 78, "review": "Try to review the material everyday, I got my ass kicked when I tried to cram the weekly assignment. Go over textbook questions if you don't get the ones in the assignments."}, {"id": 79, "review": "This course took things from high school that were simple to understand and made them unnecessarily complicated"}, {"id": 80, "review": "Assignments had very esoteric questions and the midterms were challenging. Best to work though the assignments with a friend."}, {"id": 81, "review": "It's hardly even calculus until more than halfway through the course; a lot of high school review. Pretty easy if you can keep on top of the assignments."}, {"id": 82, "review": "This course is mostly review from Grade 12 Calculus. Because of that, it was not too hard. Exams were kindof hard compared to the assignments, which was weird. But overall it was an okay course."}], "SOC 101": [{"id": 0, "review": "."}, {"id": 1, "review": "Took during Spring 2022. Classic introductory course, online with recorded lectures. Covers many different sociology concepts at a basic level. Assignments weren't too difficult, but probably very boring for people who don't like sociology."}, {"id": 2, "review": "Took this course with Prof Manji. Very good breakdown of marks/assignments so that you can do well."}, {"id": 3, "review": "The content is what you would expect. Interesting if you like soc but probably boring if you don't. Assignments and lectures were straightforward."}, {"id": 4, "review": "Took this course with Ed and it was relatively easy. Theres weekly online quizzes but youre allowed unlimited tries to get 100%, one major group assignment that's spread out throughout the term, and one major paper at the end of the course. There is a textbook and I recommend getting it as well as going to class (although its not the end of the world if you miss a few classes since he uploads recorded lectures to learn)"}, {"id": 5, "review": "I took this course with the hope that it would be a light and fairly easy course to manage, and I was unfortunately wrong. The lecture material was more time consuming than expected because the prof wants you to do the readings and take notes, watch her lecture video, and then watch/listen to additional videos/podcasts that she links. The midterm and final (35% each) had some multiple choice, with a focus on short answer questions that could be fairly vague in my opinion. The assignment (30%) also had pretty vague instructions, and the TA's seemed to refuse to give anything above a 90% even if it was perfect. I wouldn't recommend taking this course if you're hoping it will be an easy mark booster, but its not bad."}, {"id": 6, "review": "Not as birdy as I thought it would be, but pretty low maintenance course. Did not like the spread of marks this term (1 midterm, 1 final, 1 written assignment). For a class about sociology, it was a pretty anti-social class, barely interacted with the TAs, prof and students. Really enjoyed the content, as the subject is something really interesting to me. Textbook did the best job teaching cause the TAs gave very vague and minimal feedback."}, {"id": 7, "review": "If you wanted to take this course as an elective to boost your gpa (like I did), don't bother. I had thought this would be a bird course but it seemed like the TAs just refused to give anything over 85. The instructions for the questions on both the midterm long answer portion and the paper that we had to do were so vague that in the end, they could always say 'oh you could have added this as well' or 'if only you included one more example'. So if you're looking to get anything in the high 80s or 90s, there are better and more interesting classes to spend your money on (in my opinion). (This class was online and had only 1 midterm, a paper, and a final exam)"}], "MATH 128": [{"id": 0, "review": "Fun class, if you attend the lectures and even somewhat practice the problem sets (attempt a question of each type) you should be fine in the tests. Make sure to be engaged in lectures, the course is easy to get by if you do, although it is a little harder than 127 since most of the concepts are new if you didnt do AP or IB. The weekly quizzes are fair though, nothing unexpected comes up if you practice a little and listen in class. Make sure to manage your time well in the midterm and exam, it can get a little tight."}, {"id": 1, "review": "I was required to take this course, it wasn't terrible. Took it in Winter 2021, online. The tests were fair and the Mobius escape rooms were interesting!"}, {"id": 2, "review": "Felt like the course wasn't as well structured compared to MATH127. I didn't really get how the modules led to one another, so the experience was a bit disjointed for me. It is quite an easy course to do well in and requires minimal effort."}, {"id": 3, "review": "Are you in cs? Don't play yourself- take math 128 instead of 138. Weekly it took me only a couple hours to do the practice problem set before a quiz and that's literally it ever. Content is way easier (practically no proofs), its just all computation."}, {"id": 4, "review": "It was a very straightforward course. Weekly quizzes were easy as long as you do the practice problems. Midterms and finals almost identical to the sample ones they give. I STRONGLY reccommend CS students to take this over 138. The whole course is plug and chug numbers + you get a calculator and cheat sheet on your exams."}, {"id": 5, "review": "I quite liked this course more than MATH127, the content was fun once you got the hang of it (except series), problem sets are great practice. Shout out to my guy Organic Chem tutor tho."}, {"id": 6, "review": "Took this online, if you do the work and lectures, content is quite clear not easy, not too hard though"}, {"id": 7, "review": "I enjoyed this course a lot more compared to Math127. Maybe it was because it was online or the fact that I took it during my spring term so I had more time to spend practicing, but nonetheless I felt like I learned a lot more. I highly recommend doing all the practice problems provided and watching all the supplementary videos alongside the Mobius lectures. If you're having trouble even after watching the supplementary videos, try and attend the tutorials to ask questions (or watch YouTube videos). Obviously, practice, practice, practice!"}, {"id": 8, "review": "It definitely may not be as easy as the other reviews have made it seem depending on how it is weighted and how good you are at integration and series. In Spring 2021 there 10 weekly quizzes weighted at 7% and two terms tests weighted at 15%, and although there were not any real surprises on the quizzes and tests it definitely was not stress free since they were not open book and you had a pretty limited amount of time to do them. You really have to know your stuff and memorize the different formulas and depending on the unit there might be quite a few."}, {"id": 9, "review": "For online students: Use the \"Supplementary Lecture Videos\", if that's what they're called! The videos are really great at explaining concepts and applications, compared to going through the boring and monotone Mobius lessons. Do the assignments EARLY (for as many attempts as possible, due to 24h cooldown between attempts) even if they're not worth much, they can boost your mark quite a bit and have no time/attempt limits. Tests cover the material you learned, unlike the super hard tests in 13x courses, and are also untimed. I enjoyed calc 2 a lot overall."}, {"id": 10, "review": "CS students make sure you take this course instead of MATH 138. I went from 87 in MATH 137 to 97 in this course. 137 required 10 hours a week of work, this course only 1/2 an hour. There's 3 tests and 3 workshops, 2 escape rooms (groupwork Mobius assignment) and no final. Every week there's 2-3 Mobius assignments each with only 2-5 questions, and the profs help you on them on Piazza. Start them early because you get unlimited attempts (but only 1 each 24 hour period) until the due date. Profs are super nice and tests were easy. Workshops were Google sheets stuff."}, {"id": 11, "review": "The course content was straightforward. This was probably one of the easiest courses I had in the semester. Also, Dan is the goat. Watching his lecture videos was the highlight of my day. I don't think I have seen anyone as enthusiastic about calculus as Dan."}, {"id": 12, "review": "Course was pretty easy, but I did take it online. I took this course after coming from MATH 137 the semester before. At the start, learning integrals was a bit difficult but with enough practice I got the hang of it. I really liked how there was no heavy midterm or final, just 3 term tests and test knowledge only on the specific term. Workshops and escape rooms were pretty easy and made the course more fun to do. I really liked this course because it was stress free, 24 hour tests, and lots of help from TAs on piazza for the weekly mobius assignments. It wasn't like other courses where they give you some BS advice and be like \"try it on your own\". They actually help you through the entire process and guide you to the right answer."}, {"id": 13, "review": "significantly more difficult than MATH 127. i would recommend you dedicate more time to this course than you did MATH 127. the worst of it is probably series and the million different types of integration, just do as much practice as you can and i think you'll be okay."}, {"id": 14, "review": "In online, it was pretty easy. Some of the lectures weren't great at covering the more complex ideas (youtube makes up for that), but most of the content was super easy and the week's work can be finished in a couple hours. Ended with 100 though that may be due to it being unusually easy while online."}, {"id": 15, "review": "Great course, I really looked forward to the workshops where I could learn about practical applications of what I was learning. It was very stress-free as we had 3 term tests which could be completed in less than 2 hrs worth 20% each. No heavy final or midterm :)"}, {"id": 16, "review": "May be the course will be a lot better if it wasn't online. or if lectures were actually long enough to explain material properly, and showing more than one or two plain examples per topic, in a 15 min video. I think this is not enough to explain such a heavy material. This course should have been Synchronous."}, {"id": 17, "review": "Harder than 127 but the concepts were more interesting."}, {"id": 18, "review": "Enjoyed the class, do not underestimate it tho. The Series part of the course was a bit tricky. If you have Dan, you will be fine as he is very precise and if you don't understand something he can explain well at his office hours."}, {"id": 19, "review": "Not that easy compared to MATH127. Dan makes it awesome though. Make sure you sit in the front for maximum learning!"}, {"id": 20, "review": "Follow the suggested problems, go to tutorials and you have a good chance at success in the course."}, {"id": 21, "review": "Least favourite course to date. Lots of information crammed into it. Tutorials were weekly and mandatory with assignments. Not a lot of support offered by the TA's."}, {"id": 22, "review": "All straightforward stuff, no difficult proofs or anything. Just study/practice and its easy."}, {"id": 23, "review": "The organization in this course when I took it was not the best; we didn't get 6/9 weekly assignments back until a week after the final. In terms of content, I found this to be more difficult than 127, but I thought that it was more interesting. For comparison, I got the same mark in both 127 and 128, but I put wayy more effort into this course. A lot of the pre-midterm material was different integration techniques- make sure that you're comfortable with being able to identify which technique to use and how to apply it just from inspection! The key is to do a lot of practice. I personally used the textbook, the assignments, and paul's online notes, and I found that that worked pretty well. As long as you make sure to do a lot of practice, make a good cheat sheet, and utilized the past exams provided, you should be alright!"}, {"id": 24, "review": "MATH 128 (ONLINE) do the assignments. do the eol and projects and all that. some may be tough but trust me, you’ll need that practice. they gave us a cheat sheet in winter 2019; if you feel fucked and fall behind as people usually do in online courses, and don’t have enough time to learn everything, make sure to put important derivatives on your sheet. then, find practice assignments link on learn (should be somewhere I’ve forgotten). click on the assignment for each unit, enter random numbers as answers (v important, you need to answer every question), then submit. at the end, copy the breakdown of the questions on your cheat sheet and try to understand how the questions were solved. this is just last minute resort. I would say the final exam was a combination of the easiest type of questions from each unit. don’t sweat it."}, {"id": 25, "review": "I took this course online and it wasn't as hard as everyone says just requires practice but overall not hard to do well in."}, {"id": 26, "review": "I like this course for gaining basic calculus skills and not having to reproduce proofs. The assignments are challenging, but the first year tutorial centre in MC's got your back. Tests are fair and less challenging than assignments."}, {"id": 27, "review": "MATH 128 is harder than MATH 127 because there is a lot more new content. Don't worry if you don't understand some of the proof/theory, what matters is that you can apply the strategies to problems. Having a cheat sheet makes your life so much easier, because you don't have to memorize all the different integration formulas and convergence tests so take advantage of it. Like other math courses, make sure to do the practice problems. Also try not to fall behind in class, because we cover a lot of content so it can be hard to catch up. I had this course with Owen Woody who was an amazing instructor and very easy to understand. The midterm average was low and so the final was easy."}, {"id": 28, "review": "Its easy if you actually do the practice, go to lectures. I didn't know much of this course until 1 week before the final exam and I studied and practiced a lot in this 1 week and pulled of a decent grade in the final exam."}, {"id": 29, "review": "Easy course! Mostly simple problem solving, concepts easy to understand."}, {"id": 30, "review": "Very theory-based content and although they do apply some of it to science in some questions, I don't really see the need for us to take this course. 32% of the class failed the midterm and they didn't curve. Exam was easier to make up for this."}, {"id": 31, "review": "I found it quite easy, but I also found Math 127 easy. Make sure your algebra and basic math skills are up to snuff, and don't procrastinate the assignments/projects."}, {"id": 32, "review": "It was really hard, I missed a couple of classes (not in a row) and felt really behind. The material was really interested, but not that useful or applicable since it's simplified. I did enjoy it, and the exam was easier since a lot of the questions were from previous exam and they were simplified."}, {"id": 33, "review": "first half was easy...second half...not so much"}, {"id": 34, "review": "First half of the course was basically different ways on doing integrals. If you found integrals easy on 127 and you keep up with lessons and homework, you'll probably breeze through this part. Post-midterm though is about some series and infinity stuff that I could barely understand. Very conceptual and definitely struggled with this part. I would say textbook is a must-have for practice problems."}, {"id": 35, "review": "Not a bad course, but I had a shit prof. Can't remember his name now but he used the smart-board instead of the blackboard and it was crap. He didn't know what he was doing at all and wasted time messing around with his onenote notes rather than teaching. Super boring and confusing. The worksheets were very helpful, and the course itself wasn't too bad. I still did well even with a shit prof."}, {"id": 36, "review": "Interesting expansion on calculus, but a lot of applications with little proofs. Good if you just need basic calculus skills."}, {"id": 37, "review": "Almost all new Calculus material, but not too heavily based off Math127 (if you didn't do well in 127 it's ok, you can do well in 128!). Do all the worksheet problems and don't fall behind in material!"}, {"id": 38, "review": "This course is interesting - significantly more challenging than math 127! The mid-term exam was fairly easy, however, the final exam was extremely challenging! You should complete all of the text book problems and do all of the worksheets. You can definitely get a 90% in this course, however, it requires a lot of time and work."}, {"id": 39, "review": "Course was challenging, don't fall behind. Make sure to go to class even if you get lost. Reading the textbook and trying the example questions provided are very helpful. This is not a course to take lightly, the quizzes can be easy if you prepare a week in advance and are familiar with the material you've been learning."}, {"id": 40, "review": "Easy as fuckkkkk"}, {"id": 41, "review": "I owe any good performance on this course to Professor Leonard and PartickJMT, oh and Prof Morshed was also good. I did not find the tutorials of any benefit as the TA was mainly solving questions that we already had the answer to. Be ready to do a ton of self study, the material is quite intensive and they teach heavy topics in really short time periods. My advice is if you plan on taking this course, try to familiarize yourself with the material (via youtube videos) before the course even begins because once the course starts there are no breaks unless you drop it. I have taken MATH and STATS courses previously which were quite useful especially in research, but this course did not seem useful in anyway."}, {"id": 42, "review": "Don't listen to what others are saying, it's not that bad, you just have to do the homework and 80+ is guaranteed, oh and DO the worksheets, it really helps!!"}, {"id": 43, "review": "Horrible. As other people have pointed out, you're basically on your own trying to learn the material. Youtube will be your best friend.... My only advice would be to do the worksheets and practice a lot as they are VERY representative of the quizzes."}, {"id": 44, "review": "Every single prof cannot teach this course. I've lecture hopped to almost every one. Either have to teach yourself or hit up Youtube. You're paying to teach yourself here."}, {"id": 45, "review": "This course needs to be re-vamped, the way they teach it makes it so difficult for the math that it actually is."}, {"id": 46, "review": "If you put in effort you'll be fine, do the worksheets at least because the quiz questions are similar if not identical to the questions on the worksheets. Same with the midterm and final"}, {"id": 47, "review": "Really boring, but also easy, and administration introduced an alternate grading scheme."}, {"id": 48, "review": "The information will be very useful for upper years in chemistry and physics. Based mostly on integrals and background knowledge of derivatives."}, {"id": 49, "review": "if you are a math/cs major this course is a joke. easy gpa booster."}, {"id": 50, "review": "Take this online and watch professor leonard on youtube. Easy 90. The final exam was 100% identical to the \"self check\" modules in the course. DO THEM ALL! You can get a good grade!"}, {"id": 51, "review": "Keep up with lectures and you will be fine, hard but not awful"}, {"id": 52, "review": "Much much much easier than 127. The midterm was VERY SIMILAR to the practice and the final was also VERY SIMILAR to the practice final. The only reason some people do badly on this course is due to LACK OF PRACTICE. If you practice integration early on in the term, you should be set. Practice and practice often."}, {"id": 53, "review": "Definitely a must to attend lecture, and DO THE WORKSHEETS. The quizzes can go well for you and pull your grade up if you're willing to put in the effort. As with all math, practice is key."}, {"id": 54, "review": "Its pretty straight forward much harder than 127 but still pretty easy if you just understand abstract calculus concepts"}, {"id": 55, "review": "Definitely harder than MATH 127, but I found this course much more interesting and useful. Be passionate about what you're learning and nothing can stop you from succeeding."}, {"id": 56, "review": "So glad that this was my last Calculus course. This was harder than MATH 127 for me. Try your best to go to all the lectures."}, {"id": 57, "review": "Helps to nail down the important concepts you'll need further down the line. The first half of the course is pretty easy, just integration and applications of said integration. The second half is more difficult in my opinion, series are weird and shit. I've taken Math 137 and Math 128 and I'm going to be honest, 137 was easier. I'd rather do proofs than the weird application shit we'd always have to do (word problems and stuff). So if you're a CS student don't be fooled - take the 130 series."}, {"id": 58, "review": "Took this course online. I found it easier than MATH 127 but only because the final was extremely similar to the self-check problems we were given. You'll find it easy if you study enough and don't usually need the prof/TA to explain most concepts to you."}, {"id": 59, "review": "You'll have 20/20 vision after the course. It seemed hard at the time, but at the end you'll realize that it was just a few small tricks that tripped you up."}, {"id": 60, "review": "PRACTICE PRACTICE PRACTICE, that is all I can say."}, {"id": 61, "review": "hard but if you really study you will be fine"}, {"id": 62, "review": "Honestly, this course was tough and I'm nor really sure what I'm going to need knowledge about series and polar/parametric curves. Interesting though."}, {"id": 63, "review": "Fun for anyone who likes math or took AP Math in HS. Not hard to do well."}, {"id": 64, "review": "Horrible is all i have to say."}, {"id": 65, "review": "This course is not a bird course. Do not take if you don't have to. Legit spent 70% of my time on this course."}, {"id": 66, "review": "Honestly, I wish there was a neutral option for the ratings because that's how I felt for the \"Useful?\" and \"Liked it?\" sections. It was interesting at times, but it was incredibly difficult and the assignments could be really tedious. Not really that great. Then again, I'm not really a fan of math in general..."}], "BIOL 240": [{"id": 0, "review": "The online version of this course is basically a waste of time and money unless you MUST take it. Like ok? you are just watching cheesy videos and doing eternal readings only to do a weekly quiz?"}, {"id": 1, "review": "The (online) course was basically just long weekly readings that summarized the textbook. There was one quiz per week, 12 quizzes total, based on the reading you did. They start off pretty easy but quickly become very difficult. Read the weekly topic thoroughly, but don't bother buying the textbook. Overall, I didn't enjoy this course, and I think that's mostly because it was online. There was barely any interaction with the professor, aside from quick little YouTube videos he made (that I actually really liked), so I think the course would be better in person, where topics can actually be taught. No exam or midterm though, which was nice!"}, {"id": 2, "review": "It includes a large amount of reading. Quizzes became more and more difficult. Maybe this is normal in most biol courses."}, {"id": 3, "review": "I completed this course online and it was very boring. The course content was pretty much just very long articles summarising the textbook you had to read and do quizzes on. I would rather have done this course in person in a lecture hall since that would have been more engaging. The quizzes were 100% of our marks and they got quite tough near the end. Some of the quiz questions were frustrating since they tested our memory of specific things that were stated in the articles and not our understanding of the content so be careful of that."}, {"id": 4, "review": "I did not enjoy this course online. Sounds crazy, but I would have preferred a midterm and final over the weekly quiz structure they had here. The concepts were kind of all over the place and by the end, I was wondering how what we were learning even related back to microbiology. the course kind of tricks you in the sense that the first 3-5 weeks are easy to understand and the quizzes are not difficult, but by the end, you have absolutely no idea what the hell is going on. Everybody says Neufeld is an awesome professor but there was literally no interaction with the professor online because the course consisted of long, boring readings, and no lecture videos so I don't even really know what his teaching style looks like. I would recommend you probably take this course on campus if you need to/want to take it. it is also useful for me because now I know to never take another microbio course again, lol."}, {"id": 5, "review": "Neufeld is such an amazing prof and even online you can tell that he really enjoys his work. Enjoyed the little youtube videos that he made this term as well! Make sure to really do the reading, the select all that apply really messed me up in the quizzes but it's not hard to get a good mark in this course. Dont leave readings to the last minute though."}, {"id": 6, "review": "Took this course during the Fall 2020 term and it was completely online due to COVID. The marking scheme for this course was 12 weekly quizzes where 11 out of 12 were weighed to be 100%. Some of the quizzes were harder than other, but they were all based off of the content modules. Purchased the textbook, but it was not very useful. The workload is high since each quiz is 9.1%."}, {"id": 7, "review": "Taking this class online was a complete mistake..."}, {"id": 8, "review": "Interesting but the pictures were nasty. Some of the weekly quizzes were pretty tough, but overall, doable (I got everywhere from high 90s to 50s). Not the easiest course I've taken but also not the hardest course I've taken. It's very much in the middle."}, {"id": 9, "review": "Honestly, it was just a lot of memorization I did well in the end and I'd say the final is much easier than the midterm. I think the post-midterm stuff was easier to understand and memorize, so take your time with the pre-midterm material as it covers extensive knowledge of Bacteria, Archaea, Eukarya and Viruses."}, {"id": 10, "review": "I took this course in Fall 2019 with Josh Neufeld (JDN). The mark breakdown of this course is as follows: 35% midterm and 65% final (multiple choice, true/false, and matching questions), plus 5% optional clicker mark that offsets a portion of either evaluation (you need to answer at least 80% of the questions to earn the full mark but it's based on participation). The clicker questions are very representative of the questions he will ask on the midterm and final, and both evaluations are extremely fair as he only tests you on content he has covered in class. Textbook is NOT required to do well in this course. This course was a breath of fresh air after the travesty that was BIOL 130, as the midterm and exam in this course were very straightforward (very few A, B, C, A & B, A & C, all of the above, none of the above nonsense that was present in BIOL 130). JDN is my hands-down my favourite prof that I've ever had so far because he makes this (rather dry) course extremely interesting - so much that I found myself often getting up and attending the early morning lectures. He is extremely passionate about microbiology and provides the students with many different resources to help them succeed (recordings of each lecture, animations, and supplementary information for topics covered in class). JDN was also very generous on the final exam in that he removed 3 questions from the exam that he felt were too hard/worded confusingly (out of 100) despite the average below a low 70 (there was also a bonus mark!) There are 10 topics in total that are 50 - 80 slides each, accompanied with notes that give you more insight as some concepts are hard to understand if you only look at the slides or don't attend class. In order, the topic names are: Our Microbial World, Bacteria, Archaea, Eukaryotes, Viruses, Cultivation & Control, Bacterial MVPs, Regulation, Genetics, and Genomics. Even if you leave studying until the last minute, an 80+ is still easily achievable in this course. Good luck!"}, {"id": 11, "review": "not useful because i didnt take any additional micro courses but Neufeld was an amazing prof, must take it with him! he makes the class interesting and engaging"}, {"id": 12, "review": "Neufeld keeps it engaging, otherwise it could be a dry course. Midterm was harder than exam. The course moves at an average pace (composed of 10 slideshows that are about 60-70 slides each). The annoying thing about this course was that it's only one midterm (35%) and exam (65%), with clicker taking 5% from whichever you do worse on, so if you do poorly on one it's really easy to tank your mark. That said, it's definitely possible to do very well if you stay on top of the content throughout the semester."}, {"id": 13, "review": "JOSH NEUFELD! It's honestly hard to talk about this course without mentioning him. For this reason, I absolutely implore you to take this course as a lecture (as opposed to online); this breathes a lot of life into otherwise dry material."}, {"id": 14, "review": "Course is very straightforward. You don't really need to go to class if you want to get 80%. If you want that last 20%, you're going to need to go to class and absorb those minute details (i.e. Giardia causes beaver fever). Overall the class is organized and straightforward. If you've taken any other bio courses it's also easier. For example, if you've taken 309/239, the last 2 units are a joke. Good luck!"}, {"id": 15, "review": "Take it with Neufeld"}, {"id": 16, "review": "Dr. Neufeld was really engaging and made the course a lot of fun. Be prepared to try to memorize some bacteria but it is all really interesting stuff."}, {"id": 17, "review": "It is a lot of memorization but it is not a bad course"}, {"id": 18, "review": "It wasn't harder than any other course at the time but I just didn't find it very interesting and couldn't really relate to the topics. Did fine in the course tho, its just a basic understanding of things so future things seem a bit familiar when you hear about them again"}, {"id": 19, "review": "If you have Josh Neufeld as your professor this course will surely be enjoyable. Like any biology course, a lot of memorization is required, but Neufeld provides clear explanations and many resources to help you (e.g., video animations, lots of stories to relate the material to real life, and he also audio & video records his lectures so you can re-watch any you've missed or if you need extra clarification). Don't be overwhelmed by the material, it is completely manageable. The breakdown of the course covers 10 powerpoints (~40-100 slides each) and for grades: 5% clicker participation (doesn't matter if you get it wrong or right, just counts for participation), 35% midterm exam (material test is from 5 powerpoints), and a 65% cumulative exam (material tested is from 10 powerpoints). The final exam is much easier than the midterm and an overall 80%+ in this course is very achievable. Personally, I found it most helpful to attend lecture and just listen and then rewatch the videos and take notes from that since I could understand the material at my own pace. Neufeld also uploads practice quizzes (doesn't count towards grades) to help you review material for each powerpoint. These are somewhat helpful, and most of the questions come straight from the textbook. You DO NOT need to purchase a textbook for the course. When studying for the midterm and final, MAKE SURE to review the clicker questions he has asked throughout the year (he will post them on learn), they are very representative of the level of difficulty to expect, and some of the questions are very similar or even the same as what you would see on the actual exams. Good luck!"}, {"id": 20, "review": "This was by far my favourite biology course to date! The content is very interesting, particularly for those with an interest in exploring the microbial world. The content is relatively straightforward, particularly if you've taken cell biology or genetics prior to this course. The mid-term exam and the final exam were both very fair! The content came directly from the slides and from the profs lecture, just be sure to take detailed notes. The textbook (I read each chapter) was helpful, but did not really give any advantage on the exams. Finally, Dr Neufeld is an amazing professor! He is so engaging and is truly passionate about his field. I highly recommend taking the course with him."}, {"id": 21, "review": "This course was a breeze. Would recommend taking as an average booster if you have some background knowledge in biology, easily 80% above. You do need to stay on top of lectures otherwise the information can be a little overwhelming. Concepts are explained well in class, would suggest to read over in the textbook some of the more difficult concepts for clarification. Final marks are based off a midterm and final so make sure not to screw one of those up."}, {"id": 22, "review": "Last time I've taken any biology-related course was from Science 10 which I took 6 years ago. This is the most difficult, most time demanding and driest course I've taken in university. Studied hard, thought I knew most of the stuff, but midterm was very focused on tiniest details which I was not sure of. I am taking it because I am forced to, but if I had a choice, I would never take it."}, {"id": 23, "review": "One of my favourite bio courses so far. Midterm was easy and Josh Neufeld is hilarious and a really good prof. There's a decent amount of memorization, not as much as some people made it seem and the content is easy. Not hard to do well if you just memorize the slides. Its a typical bio course that doesnt require much work."}, {"id": 24, "review": "Easy 90 if you read the textbook along with the lecture notes. Some things you do need to memorize rather than understand - especially on midterms/final there will be questions that are very specific"}, {"id": 25, "review": "lots of memorisation"}, {"id": 26, "review": "Interesting class, not that exciting though. You do need to memorize a lot but it wasnot hard to do. whats interesting is that the proff used to post videos of the lectures on learn which made it easier to keep up with the material and learn everything from lecture and not needing to rely on the book. if you can get everything taught in the lecture you wont need the book. even though the course was only a midterm and a final, it was not hard to get a good grade"}, {"id": 27, "review": "Not very difficult midterm and final exam was incredibly easy. 90+ easily achievable, but 95+ can be tricky. I was bummed that the final exam did not specifically emphasize the mechanisms but rather throw in irrelevant nit picky questions straight from the slides that test pure memorization rather than learning concepts. Should have made the final exam harder by throwing in the mechanisms because that would have made the exam much more interesting!!!"}, {"id": 28, "review": "This course really helped me with my sleep deprivation. Every time I tried to study for it, my brain just couldn't comprehend the boring material and I'd wake up 1 hour later feeling as refreshed as ever from the power nap I don't remember taking. There are some folks out there who are passionate about knowing EVERY DAMN species of bacteria and their preference for oxygen, salt, heat, enzymes made etc... (seriously there is so much to know), but for the most part, I don't see why anyone would want to take this course if they weren't forced to"}, {"id": 29, "review": "Lots of content in this course. Exams should definitely not be in multiple choice format, it does not promote learning for this type of material. Overall it was an OK course but it could easily have been better."}, {"id": 30, "review": "This was a very enjoyable course! A good mix of old and new information. Not overly easy, but completely manageable if you care about the subject matter at all."}, {"id": 31, "review": "interesting content, typical memorization/regurgitation course."}, {"id": 32, "review": "Very typical biology course, involving lots of rote memory and the occasional need to apply some of the theory. Can be a particularly dry course if you do not have an interest in microbiology itself. But nonetheless, keep up with the material and it should be a course that is definitely possible to do well in."}, {"id": 33, "review": "A pretty easy class if you take it online - no midterm just a final and 3 assignments."}, {"id": 34, "review": "Took the course online, it was a breeze compared to in class!"}, {"id": 35, "review": "Know everything that is on the slides and you should be fine"}, {"id": 36, "review": "It was a pretty straightforward memorization class. Still found it covered interesting topics, and would definitely recommend to anyone who is interested in microbiology (especially if you can get Laura Sauder as your professor)."}, {"id": 37, "review": "Lecture slides were easy to follow and add notes to in lecture"}, {"id": 38, "review": "Builds on a lot of information covered in other biology courses such as Bio 110, Bio 130, or Bio 165. Coming into the course having already taken those gives you a huge head start over anyone taking this course from a different faculty or as an elective. Very detailed with organisms, but for the most part the exam was straightforward. The assignments (in the online course) were all designed to get you more interested in the microbiology field."}, {"id": 39, "review": "basic intro microbe course"}, {"id": 40, "review": "Never take this course online. I hated every minute of it. The assignments have nothing to do with the course material. There is a group assignment that was also a gigantic waste of my time. The lectures are dull and boring. There could be so much done to improve the way this course was taught in order to garner interest in the material."}, {"id": 41, "review": "Microbiology was amazing. Learning about the different diversity microbes that exist within our world and how they can affect humans and other species. Overall great course! Midterm and Final exam were extremely fair"}, {"id": 42, "review": "It was a good biology course. Really liked it, keep up with the lectures."}, {"id": 43, "review": "Similar to genetics in terms of amount of material to know and memorize overall a very interesting course. Neufeld is bae."}, {"id": 44, "review": "Go to your own section for iclicker participation"}, {"id": 45, "review": "Useful and interesting course, but a lot to know."}, {"id": 46, "review": "Interesting course, fairly easy, great prof"}, {"id": 47, "review": "gerg"}, {"id": 48, "review": "A nice general course on microbiology; covers many core concepts useful in upper years."}], "CS 145": [{"id": 0, "review": "Starts out very easy, ramps up quite significantly, but for anyone who's experienced with programming, it's not all that bad. The note about how previous experience can hinder you is true, in a way. You need to rethink how you're writing programs instead of taking what you'd think of as the most intuitive option."}, {"id": 1, "review": "Everything was easy. But the finals was hard af. However, it is very possible to get an almost perfect mark pre-finals even for students without a lot of previous coding background (such as myself). Plus, the finals was only worth 20%, so a low finals did not really affected much."}, {"id": 2, "review": "Starts out easy, difficulty ramps up significantly in the last third"}, {"id": 3, "review": "Assignments got way harder at the end of the course, but they also got much more fun/interesting to do. Not that hard to get a good mark, but you do need to put legitimate effort."}, {"id": 4, "review": "A really interesting and fun course that starts of slow, but ends with some tougher assignments. The assignments are pretty fun, and Gordon Cormack is an amazing professor. Definitely take this course over 135 if you have previous computing experience (not that it will necessarily help a lot) The end of the course features some imperative programming with machine language which is also very interesting. Overall a very fun course!"}, {"id": 5, "review": "Fairly straightforward, most questions are fun puzzles except this one stupid question where you play rock paper scissors against a bot with an unknown strategy so the solution becomes extremely luck dependent. This course involved more actual problem solving than 135 from what I heard due to the unnecessary design recipes (coined as \"hot garbage\" by Cormack and the TA's), so I would recommend this if you have any coding experience. Only downside of this course would be that Racket is an utterly useless and illegible language."}, {"id": 6, "review": "Pretty good course. Some of the assignments weren't very fun/interesting, but it's whatever."}, {"id": 7, "review": "Professor Cormack and the ISAs were extremely helpful. Try to squeeze as many marks before the final before you bomb it. I spent around 5 hours/week on the assignments so it was no biggie. The final was hard."}, {"id": 8, "review": "I am in CS so I might be biased, but this course was definitely my favourite from 1A. 12 weekly assignments (60%), two midterms (10% each) and a final (20%), but I took this course online (Fall 2021) so the weights may be different in person. Overall this course was great at teaching some core computer science concepts, and most importantly how to think critically and solve tough problems, which is much more important than CS 135’s design recipe. Even though this course teaches Racket, a lot of the content and problem-solving skills will transfer over to other languages, so this is definitely not a useless course. Some of the reviews seem to find this course very easy and others very tough, it definitely depends on the person but I think everyone can agree that the course gets harder as it goes on. That being said, I also found it got a lot more interesting too, and the final assignments were generally the most fun and interesting of the term. For me, I found the assignments took comparable time on average to MATH 135 (around 6-ish hours) and most of them were doable in one day, although the first few assignments were a little quicker and the final 3 assignments took longer to finish. I would definitely recommend anyone who has prior programming experience to try this course. You can always drop down if it’s not for you, it’s definitely not as bad as the advanced math courses (145 and 147) and it was a really great experience!"}, {"id": 9, "review": "Interesting course that starts easy and gets more difficult after each midterm. Having basic knowledge in programming concepts will help, but if you are willing to put in extra time, the course isn't that difficult. Overall, the course teaches important CS concepts regardless if you think Racket/functional programming is useless."}, {"id": 10, "review": "If you have previous coding knowledge it is easy and fun, no stupid design template like in 135"}, {"id": 11, "review": "Having general knowledge of CS going in is very helpful. The course has minimal busywork and the assignments help a lot with understanding."}, {"id": 12, "review": "Difficulty sky rockets after the second mid term. Other than that, it is a great course, Cormack teaches pretty well and the grade distribution between assignments and exams is well balanced."}, {"id": 13, "review": "The best 1A course I have taken and I enjoyed the challenge. There were times I literally died but looking back I had an absolute blast. It's a tough course but 100% worth it."}, {"id": 14, "review": "The assignments are very well-designed, so if you just do them you will be good. The material is interesting and there is not as much busywork as CS 135 so I recommend taking it if you have the option."}, {"id": 15, "review": "CS 145 really helped me understand recursion on another level and was really great at introducing new concepts with assignments. The course was 60% assignments, 20% for 2 midterms, and 20% for the final. I found the assignments really challenging (especially after the second midterm) but really worthwhile and satisfying to do. The final was hard, although most of my friends had close to full marks before the final. Overall would recommend if you want to learn a lot and grow as a programmer!"}, {"id": 16, "review": "Racket is overall a useless programming language, but I do learn a lot from this course. Some of the material in the latter half of the course is highly related to future courses (computer architecture, RAM, IO stream, etc). Also, the rock-paper-scissor and the Karatsuba algorithms assignments were really fun."}, {"id": 17, "review": "My favourite course of 1A! It was really interesting learning about the programming concepts and although half the assignments were pretty challenging, it was extremely satisfying once you got them right (you can see if your code pasts all the tests or not on a cooldown). Furthermore, the tight-knit (online) community for CS145 was sublime. It was incredible conversing with so many super smart people and the TAs (Rivers and Benjamin) were really helpful, knowledgeable, and welcoming. If you like CS and you have the option to take this course - TAKE IT!!"}, {"id": 18, "review": "The course itself isn't too challenging if you have prior experience with programming. Getting used to the functional paradigm might take a while, but once you get used to it the assignments are quite simple. Be prepared for a slight increase in difficulty at the end though."}, {"id": 19, "review": "The end of the course got kind of hard. Taken online."}, {"id": 20, "review": "Very interesting course overall, assignments are pretty easy if you pay attention in class. Midterm and Final were very fair."}, {"id": 21, "review": "Very interesting course. Covers many interesting materials. No design recipe. Recommended for who had prior experience in programming."}, {"id": 22, "review": "I really enjoyed the class. Cormack is a really funny and engaging professor. The two midterms and finals were not really hard in my opinion but you do need to memorize and pay attention to the lectures to get a good grade."}, {"id": 23, "review": "Unlike CS135, it's more theoretical and you don't have to care about code style. Easier than MATH145 and MATH147. All hail the lambda."}, {"id": 24, "review": "Most people in the class are very smart, but it's probably one of the easier advanced classes. Initial assignments were pretty easy, but got much harder once Lambda comes along. It can get frustrating at times with efficiency restrictions but at least you don't need to deal with the 135 design recipes."}, {"id": 25, "review": "Great if you're a lambda enthusiast. Prepare to write lots of Racket. But fear not, you do write useful algorithms instead of maintaining code style like CS135."}, {"id": 26, "review": "Maybe I'm biased because I love haskell and functional programming in general, but I found this to be a fun and engaging course in the second half. The first half was a bit boring, but it gets worth it for the end. Mind you, if you've never done functional programming before, Racket and the lambda calculus can be infuriating. But I definitely enjoyed it."}, {"id": 27, "review": "2017F, Cormack. A good course in general plusTA (Ashish) was extremely helpful. Bombed the first midterm but ended as my highest mark of the term."}, {"id": 28, "review": "Awesome course, explores some highly theoretical topics such as models of computation and lambda calculus. Shoutout to Ashish Mahto, the best ISA in the world!"}, {"id": 29, "review": "Racket is bae"}, {"id": 30, "review": "Quite difficult, but I loved the material and it was very useful."}, {"id": 31, "review": "Amazing course, highly recommended to take it, but be ready to work hard. Also if you have a good ISA like I did (Ashish Mahto), be sure to go to his office hours and let him help you!"}, {"id": 32, "review": "Assignments are lots of fun, but tests are difficult. Curved at the end of term, had a great experience taking this course."}, {"id": 33, "review": "It's easier compared to CS135 in terms of complexity. Though tests are hard, the curve was pretty nice."}, {"id": 34, "review": "I took this in Fall 2015 with Brad Lushman. It was definitely difficult for me, because I had never seen functional programming /Racket stuff before. We ended up working our way up to building a Racket interpreter ... written in Racket. The stuff I learned here basically made CS241 trivial..."}, {"id": 35, "review": "Be warned, very hard! That being said, it is extraordinarily well designed with great content, assignments and tests."}, {"id": 36, "review": "Loads of material but if you go to lectures & pay attention it's not a super tough course."}, {"id": 37, "review": "This is a really interesting course, and is much more useful than I expected."}, {"id": 38, "review": "If you love CS and are confident in your programming abilities, this is the course to choose. Assignments are pretty simple, tests weren't."}, {"id": 39, "review": "The course was very fun and interesting, learning about the theory of computer science. There was an extremely interesting example we returned to several times throughout the course of representations of natural numbers, exploring beginning with Peano arithmetic, going through other representations such as binary, exploring time and space efficiency for each method. The assignments were much easier than the tests. Be prepared."}, {"id": 40, "review": "Definitely worth taking compared to CS 135"}, {"id": 41, "review": "Pretty hard course with fun assignments. You get to write an interpreter in the last few assignments."}, {"id": 42, "review": "Incredible course. Not as hard as people believe it to be, some assignments are challenging and the proofs can be tricky but most assignments are quite straightforwards. Also takes very little time, the assignments are shorter than CS 135 and the exams are the kind where studying won't help you. This course took me way less time than my friends took doing CS 135."}, {"id": 43, "review": "The course is very well designed and is, to some extent, a survey course of all of computer science. The course descriptions are technically correct in saying CS145 requires no prior CS or programming knowledge; however, experience with debugging techniques, some knowledge about functional programming, a good intuition for algorithms, or even just a large working memory will make the course significantly easier."}, {"id": 44, "review": "The 2nd midterm is much harder than supposed!"}, {"id": 45, "review": "A difficult introductory course in Computer Science. The first assignments were designed to weed out weaker students, and the workload was more reasonable later on. For most people, prior programming knowledge is not helpful in the course; a logical mind is essential. Course content was exceptionally interesting and useful."}, {"id": 46, "review": "This comment is sort of outdated since 145 has now been split in to 145 and 146, but when they were 1 course together the workload was way too high. It's probably more manageable now, which would make the course worse considering. I wouldn't take it again the way it was before."}, {"id": 47, "review": "Take this."}], "CS 370": [{"id": 0, "review": "Some basic linear algebra and python are required. Very fun though, easy to do well."}, {"id": 1, "review": "Toshiya is goated prof. Class median was 92%"}, {"id": 2, "review": "Final exam was a bit tough for me, but overall the content was easy and the professor even gave us an assignment with an extra 40% bonus question."}, {"id": 3, "review": "Covers quite a few interesting and relevant topics. Professor Batty is a great lecturer, going over helpful examples in class. Assignments are mostly written work as well as some Python programming ones."}, {"id": 4, "review": "Well-organized course. Material could be a bit dry at times but the assignments were useful and fun. Excellent prof."}, {"id": 5, "review": "Great course with interesting assignments thanks to Nolan Shaw who elevated the course and provided engaging lectures."}, {"id": 6, "review": "I loved this course. In assignments, we applied the algorithms we learned to solve real-world problems, which was very cool. The midterm & final were fair."}, {"id": 7, "review": "Took it with Kimon Fountoulakis. Bi-weekly Python assignments which are just application/implementation of things from the notes. Pay some attention to theory for the midterm/final though. I personally didn't find the course content terribly interesting. Prof. Fountoulakis is good though."}, {"id": 8, "review": "Was a pretty fun/chill course. Assignments were bi-weekly in Python, and learned about some interesting things like DFT and Google Page Rank. This course was set up really well and has a very fair grading scheme as well, in my opinion."}, {"id": 9, "review": "Took it in the pandemic. Biweekly assignments: a combination of programming and calculation and little bit of proof. Final was very hard."}, {"id": 10, "review": "Really enjoyable course with relevant material + interesting assignments"}, {"id": 11, "review": "Professor Batty teaches this course really well. He is clearly enthusiastic about the content, explains it well, and ties it to real-world applications. The course content is interesting and provides some practical insight into how computers crunch numbers practically."}, {"id": 12, "review": "Love this course, has a ton of interesting content."}, {"id": 13, "review": "Great course that teaches some math applications of computer science. Took with Jeff Orchard and the assignments and exams were fairly easy."}, {"id": 14, "review": "This is reportedly the easiest third-year CS elective, so have fun!"}, {"id": 15, "review": "The material itself can get very theoretical (Fourier transform, linear algebra, numerical approximation for differential equations), but all the concepts have useful applications in real life. We used python, and not matlab, which was great."}, {"id": 16, "review": "My anus was torn apart by George Labahn's exams"}, {"id": 17, "review": "This course seems to vary a lot depending on who is running it. My offering was pretty straightforward, though the course concepts were pretty disconnected. It's a good course if you want experience with MATLAB, but besides that, there aren't a lot of fundamental takeaways."}, {"id": 18, "review": "They recently reworked the course to add forensics cases and it made it so much more cooler. This course was pretty easy."}, {"id": 19, "review": "MATLAB, floating point, interpolation, ODEs, fourier transform, pagerank/linear algebra. That's the entire course, and it's fairly manageable."}, {"id": 20, "review": "Study and this will be an easy one :)"}, {"id": 21, "review": "It's a math course and allows you to bring a cheat sheet to exams. One of the easiest courses you can get in third year."}, {"id": 22, "review": "It's easy if you put the effort into it. I strongly suggest not skipping lectures."}, {"id": 23, "review": "\"WTF, man I just wanted to learn how to program video games...\" - CS365 commenter, 2012"}, {"id": 24, "review": "You spend a few weeks talking about a few completely separate concepts - floating point error, interpolation, ODEs, DFTs, and numerical linear algebra/page rank. The assignments were fun, with some interesting practical application questions. If you need to use a matlab GUI for an assignment, the thin clients in MC are much faster than SSHing in."}, {"id": 25, "review": "Fairly interesting course, and really easy if you did well in your first and second year math courses."}, {"id": 26, "review": "You will learn a wide range of computation techniques with interesting applications, like image compression, Google page rank, solving linear systems/ODEs, etc. It's very much an application-focused course, with emphasis on understanding the intuition behind those techniques and knowing when to use them. That also means you rarely have to do rigorous proofs - maybe that's what CS371 is for. Midterm and exam were both quite easy this term, despite the horror stories I've heard from previous terms. So difficulty might depend on the instructor you get."}, {"id": 27, "review": "really interesting content, hard to understand the lecture but you can finish assignment and exam by google lol"}, {"id": 28, "review": "It was hard and I don't see myself taking this knowledge elsewhere, but it was overall super fun and interesting. The exam was open book, but it really wasn't that difficult if you understood how to use the text."}, {"id": 29, "review": "Pretty fun and straightforward course."}, {"id": 30, "review": "Heavy in math. Can be interesting with the right prof"}, {"id": 31, "review": "You're going to have to take it. It was actually pretty good."}, {"id": 32, "review": "Hated this..."}, {"id": 33, "review": "Mark G has the easiest final in the world!"}, {"id": 34, "review": "I love this course. The assignments are so interesting and programming assignments were a little not so well defined, but they were fun once you figure out how to do some of the basic MATLAB stuff. The course content kept me engaged the entire course and I would love to take more of scientific computing courses in the future. This is more of a math course than CS course. Most of the times exams are open book :)"}, {"id": 35, "review": "This was my absolute favorite course in all of university. Fascinating material; challenging but fair."}, {"id": 36, "review": "Although I took this as a graphics prereq (and now graphics won't fit in my last term schedule), I LOVED learning about Fourier analysis and transforms. Trying to get the intuition behind them was also a very enlightening experience. This is actually more of a math course than a CS course. Be warned, it involves linear algebra and differential equations. Very easy and basic MATLAB programming if you can program."}, {"id": 37, "review": "Great course - I originally took it just as a pre-req to Graphics, but it ended up being a very interesting course in its own right. Kind of jumps around to a lot of different, fairly disjoint topics, but they're all interesting and relevant."}], "MUSIC 140": [{"id": 0, "review": "The greatest course you could take at uw! If you have any interest in music, this course is super enjoyable and easy. I found a little bit of studying was necessary, as some of the multiple choice questions can get pretty specific, but really, studying was listening to a playlist and recalling what we talked about in class. Lectures cover the evolution of pop, R&B, country, and rock n roll from the 1920s - 1980s. There is so much to talk about, so the 3 hour lectures are packed with content but I loved it so it didn't seem long. No music knowledge is required, but the course is even better if you have some musical background or an interest in music history."}, {"id": 1, "review": "best course i've taken at UW hands down. simon really knows how to tell stories and make the content engaging. the material itself is fascinatingly relevant even today and should be interesting if you like music at all, which who doesn't. i personally found it very eye opening to learn about how the pop music industry came to be what it is today. pop music history is definitely taught less commonly things like world history, yet is something that it is way easier for me to care about and way more fun for me to think about in my free time. this could just be the result of a personal greater interest in music and culture compared to academia, but also likely a testament to how well this course is designed and taught to be stimulating and educative"}, {"id": 2, "review": "super birdy course but besides that, i think it was a very eye-opening course and helped to spice up my courseload this term from the usual science classes i take. prof simon wood is super chill and engaging. after taking this course, i really wanna take 246 which is also taught by him. 10/10 recommend, you'll defo get 90+ with minimal effort"}, {"id": 3, "review": "Term: F2021 (online) Prof: Simon Wood Best lecturer you'll have, even online. His lectures are well-edited podcasts you can listen to anywhere you go. But this course is better taken in person to appreciate Simon's gift of lecturing. It is birdy, 4 quizzes you can ace by ctrl+F'ing everything, but you'll miss the magic if you treat it like this."}, {"id": 4, "review": "Took it online during the pandemic. It is a fun music history course on different genres of music and how they affect popular music today. There were 4 MC quizzes that weren't too bad and I got high 90s for this course."}, {"id": 5, "review": "Maybe the greatest course offered at UW. This is a MUST TAKE for anyone. Simon Wood makes it a lot of fun, and you learn some cool stuff about music history. I had the 3 hour Tuesday slot, and I don't remember ever looking forward to a 3 hour lecture throughout my entire undergrad as much as I did with MUSIC 140. 10/10 would take again, unfortunately, I'm graduating :("}, {"id": 6, "review": "[ONLINE] This course is seriously the only thing that got me through Fall 2020. Prof. Wood was a wonderful professor who struck the perfect balance between being funny and entertaining but still being able to get to the nitty-gritty of things and teach exactly what you need to know. Exams were straightforward and tested exactly what was covered in lecture. Listening to the weekly lectures doesn't even feel like work, more like an enjoyable podcast."}, {"id": 7, "review": "If you take this course and regret it, email me at normnormnorm@gmail.com and I will personally e-transfer you $100, that's how confident I am that you will not regret taking this course"}, {"id": 8, "review": "Easy, and SO much fun. 3 hour evening lectures are usually pretty annoying, but I looked forward to every one."}, {"id": 9, "review": "First term under the online format - still an interesting and fun course. Exams were pretty easy, all multiple choice, each covering a quarter of the course. Lectures were posted once a week, and were anywhere from 2 to 4 audio recordings, with lengths ranging from 30 mins to over an hour. Basically like listening to a weekly podcast."}, {"id": 10, "review": "Not necessarily useful but the content was super interesting. Made me a lot more interested in music history!"}, {"id": 11, "review": "Maybe not actually useful but you will be surprised how the stuff covered in this course pops up in your life."}, {"id": 12, "review": "Loved every second of it! Join it for an experience that you will forever cherish :)"}, {"id": 13, "review": "The best course I've ever taken"}, {"id": 14, "review": "This course is so good that I didn't even want to take notes because I didn't want to miss a single thing the prof said. Can get 80+ in the course with studying just the day before tests. Lots of memorization. Amazing prof but a 3 hour lecture at night can be tiring."}, {"id": 15, "review": "This course was a basically a fun history course for anyone who likes popular music. Attending class is definitely necessary since the prof doesn't provide lecture notes beforehand. But the class is really enjoyable and everything is really easy to remember. Easy 80+ without studying much, but easy 100 if you put in a little effort into studying."}, {"id": 16, "review": "Prof was Simon Wood - 2 MC midterms and 1 MC final. Great prof, fun course."}, {"id": 17, "review": "Prof Simon Wood is so nice, he made the class so enjoyable. He is an amazing person. God bless the man. The content is fun, you really get to know why we see what we see today. I had a 3 hour class on Thursday nights."}, {"id": 18, "review": "This was an awesome course. I really recommend it if you like music and/or need a fun elective. Your mark is based on 3 multiple choice tests, so it's all memorization."}, {"id": 19, "review": "Favourite course of my undergrad...I am a Biology Major too. Music 246 was also awesome"}, {"id": 20, "review": "Excellent and interesting course. I really gained a nice perspective into the topic of music in North America."}, {"id": 21, "review": "Amazing course. Really interesting material."}, {"id": 22, "review": "If you're at all interested in music history, you'll love this course, and if you put a reasonable amount of effort in, you'll get a very good mark."}, {"id": 23, "review": "Fun course, but multiple choice exams make it difficult. Lots of memorization, particular of band names and significant dates/events. If you grew up in Western culture you probably already know the songs and people. Even better if you are an Elvis/Beatles fan. I was none of the above, so I found the course to be rather difficult. But it was useful, as it helped me in understanding the Western culture."}, {"id": 24, "review": "This was my favourite course so far in my undergraduate career! The classes were so fun and I looked forward to them each week! The midterms were really easy if you actually went to class, took good notes, and studied. The final was a little bit harder but not too bad. Yes, you have to remember dates and there are some trick questions but if you know the material, it's easy to do well(80+) in this course. There isn't enough good things I could say about this course. If you have the chance to take the course, TAKE IT! You won't regret it!The only thing that sucks about this course, is the fact that it's over :P"}, {"id": 25, "review": "Super fun, interesting and easy. Final was harder than the midterms but still fairly easy. Best three hours of my week."}, {"id": 26, "review": "Fun and engaging course, marking scheme was 2 multiple choice midterms and a final."}, {"id": 27, "review": "More like modern history mixed with music."}, {"id": 28, "review": "Read the textbook, questions from the text will appear on the test"}, {"id": 29, "review": "Lots of fun, I highly recommend it. Not terribly practical, though. Provided me with some great insight into how pop music really works."}, {"id": 30, "review": "I recommend this class to everyone who asks me about it! It's good fun if you can get past the fact that it's an evening class."}, {"id": 31, "review": "The course itself is easy, but the tests are hard"}, {"id": 32, "review": "Midterms are hard with all the MC combinations he gives. Was told that last year's class average was around 73%."}, {"id": 33, "review": "Must take! Very interesting course. Definitely take it with Simon Wood. The exams are quite tough, even though they are all MC."}, {"id": 34, "review": "The course may not seem all that useful but I definitely don't listen to music the same anymore. For someone who doesn't know a whole lot about music/instruments there are some kinda cool things that you might learn about music or music industry."}, {"id": 35, "review": "I actually found it ridiculously hard, even though it was interesting."}, {"id": 36, "review": "I loved this course. You don't just learn about music, you also learn about American history, politics, psychology, etc. This isn't just a plain old music class, but a course that ties together a number of subjects into one big real picture. It's not a hard course, but it's not easy. If you attend every lecture, take good notes, and read the textbook every now and then, you'll do fine ~"}, {"id": 37, "review": "Not the most useful in the grand scheme of things, but overall a lot of fun and pretty easy."}, {"id": 38, "review": "This course is genuinely interesting and you learn a lot more than just music history. In it you examine the cultural and political events that were happening at the time and how it affected popular music. Overall I'm really enjoying this course."}, {"id": 39, "review": "My favourite course in UW out of my entire undergraduate career."}], "PHYS 122": [{"id": 0, "review": "Awesome and very interesting, but a quite challenging course. My advice for anyone taking this course is to go to office hours, learn the actual physics involved and not just the math, and to do the mastering physics assignment early. As long as you are familiar with the actual physics at hand the problems should all be doable."}, {"id": 1, "review": "I really liked this course. I did IB physics, and found electricity to be the hardest unit, simply because they crammed basically a whole course in it over a period of 6 weeks - and as a result, I failed my HS unit test. That made me extremely nervous for this course, because electricity was never something I've ever understood well. Boy, was I wrong. Lectures were clear and alongside the textbook the concepts were introduced in an excellent manner. I actually understood electrical laws and circuits for the first time ever, and even enjoyed doing them. The course was fun, and aside from the 8:30am starting time, it was fully worth it. I enjoyed having Prof. Cummings as a lecturer and look forward to studying electricity in further detail in the future."}, {"id": 2, "review": "Content was interesting -- especially since electricity and magnetism is covered briefly/non-rigorously in high school (if at all). Tests were extremely easy compared to PHYS 121, and sometimes copied directly from the Mastering Physics (homework problems). The test average was mostly kept down with tricky (or often just badly written) multiple-choice."}, {"id": 3, "review": "PHYS 122 is definitely a bit more challenging than 121, but it too is pretty much just a more advanced review of high school physics. You will be ok <3"}, {"id": 4, "review": "meh took it with scholz, so you know"}, {"id": 5, "review": "It is what it is, just take it and move on. Fairly straightforward if you just follow the textbook. Prof. Mann is the only professor I can comfortably watch lectures of at 2x speed and fully understand what he says."}, {"id": 6, "review": "Took it online. Mastering Physcis throughout. Amazing how no new concept is introduce beside the concepts from high school but it still digged into the detail with new equations that connects everything."}, {"id": 7, "review": "Difficult course, make sure you attend classes and pay attention no matter how boring they may seem."}, {"id": 8, "review": "Awful class. Take PHYS 112 instead. Save your average. [Update 2022]: Just don't take with Dr. Guenter Scholz."}, {"id": 9, "review": "Hard af."}, {"id": 10, "review": "Good foundation course, but pretty hard"}, {"id": 11, "review": "Took it with Rohan Jayasundera, too bad he's retiring. Do the 'optional' practice, as it helps you learn the content at the pace the course goes at."}, {"id": 12, "review": "Spent a lot of time on simple harmonic motion and sound with mathematical modeling. We started electricity half way through the term and rushed through magnetism in the last two lectures. There is lots of calculus involved and some trickier topics you may not have seen if you did not do AP/IB in high school."}, {"id": 13, "review": "Honestly hard as fuck, there's a LOT of material and requires a lot of homework. If you don't need the course, I highly recommend you take Phys 112 instead."}, {"id": 14, "review": "LEARN THE EXAMPLES HE GIVES."}, {"id": 15, "review": "It requires a lot of work out of you. it can be easy if you have time to do all the homework."}, {"id": 16, "review": "This course is very loaded, so be prepared to dedicate a lot of time to this course, and thus manage your load wisely. I'd say take this course and not more than two more others. In addition, you should do as many practice problems as possible, because assignments will probably be insufficient. The exams can be very challenging, so..."}, {"id": 17, "review": "Interesting topics covered."}, {"id": 18, "review": "The final was ridiculous. If Scholz tells you it's going to be at all manageable or \"easier than the midterm\", do not listen to him. Study like crazy and you should do alright."}, {"id": 19, "review": "Some of the material was review from high school physics, but a lot of new stuff too. A good course that can be challenging at times. The final isn't as hard as everyone says it is, just make sure to do a lot of preparation for it."}, {"id": 20, "review": "The textbook is very helpful for this course. Read it, and you should do well. Lectures were mind numbingly boring, even for a physics major who enjoys physics."}, {"id": 21, "review": "Waves half is simple, electricity gets a bit more complicated so careful attention to detail in the textbook is essential."}, {"id": 22, "review": "It's really easy to fall asleep in the classroom usually assigned to this course."}], "ECE 358": [{"id": 0, "review": "Final was very hard online."}, {"id": 1, "review": "This is a well-structured course. The labs allow you to learn alot. The second lab is a bit long but spans over 4 weeks. Start as early as possible."}, {"id": 2, "review": "A lot of small concepts which are not difficult by themselves, but there are a lot of them. Lots of useful content, but about half the course is on the link layer. Would've been nice to spend some more time on higher level OSI layers. Content can be a bit dry, but TA's are helpful and the slides feature animations which help drill in concepts. Might not help you in your day-to-day engineering job (unless you're a Network Engineer) , but overall worth it if you're trying to understand how the internet works."}, {"id": 3, "review": "Probably one of the most relevant courses I've take as a software engineering student. Especially if you're doing web development."}, {"id": 4, "review": "I mean, yeah, you should probably know how networks work. Pretty content-heavy course, but the midterm and final were very procedural."}, {"id": 5, "review": "Important to have this basic introduction to networks and I liked the course despite some of the lectures being pretty boring. I heard that previous offerings had problem sets that were more proof-based and mathematical than ours - we just had 2 labs with (pretty tedious) programming of a few simulations in our choice of language, and 1 lab that was explaining packets and basic networking tools. Exams were straightforward with questions that were predictable if you went to lectures and tutorials."}, {"id": 6, "review": "The course does a good job of covering networking fundamentals. It follows a top-down approach that examines the entire network stack from the application layer to the link layer. There are a few programming assignments that involve building network simulations. These can be time-consuming, but help teach core concepts."}, {"id": 7, "review": "Lots of useful information in this course. Textbook is excellent, worth a read on your own time. However, quite a boring subject and hard to sit through lectures"}, {"id": 8, "review": "I'd definitely say that this course offers the minimum networking knowledge that every software developer should know."}, {"id": 9, "review": "This course was a great insight into the workings of the internet. I would recommend it to anyone who is perplexed by the magical nature of our Internet."}, {"id": 10, "review": "A light and quick overview of concepts like routing, IP, and TCP. It's useful content to know but is quite dry when presented in lectures. In my offering, the paper assignments were proof-centric and the programming assignments made use of the C socket API, which takes some time to get used to. Though the course isn't content-heavy, the workload was fairly high because of the two parallel sets of assignments."}, {"id": 11, "review": "Already knew all the content. The programming assignments were a joke, we handed in practical trash and got 100%. Written assignments were the only redeeming feature of this course, they had some interesting proofs."}, {"id": 12, "review": "pretty weird course"}, {"id": 13, "review": "Grading in the offering I took varied wildly, and marking guidelines were unclear and sparse. Always ask for as much additional clarification as you think you need to complete the problem correctly."}, {"id": 14, "review": "Course was very useful. It teaches you the complete network stack. It's not an easy course (at least for our offering with Mahesh - see review below). Assignments were semi to very challenging. Both midterm and final exam were HARD!!"}, {"id": 15, "review": "Great course, very useful and interesting content. It looks like difficulty is based on the prof. The textbook is very well written."}, {"id": 16, "review": "One of the most meh courses of my university career."}, {"id": 17, "review": "I initially thought I would find learning about protocols boring, but it turned out to be interesting and useful. I now have a cursory understanding of the entire network stack that makes up the internet, and all the layers of protocol that allows a message sent from one computer to any other computer on the internet. Do not be tempted to procrastinate on lab 2 after the really easy lab 1."}, {"id": 18, "review": "Tons of breadth and a reasonable amount of depth too. Most acronym ridden course I've ever taken."}], "PLAN 100": [{"id": 0, "review": "Sets the background of a lot of ideas you'll use in other courses. Also just interesting to learn about the development of the field."}, {"id": 1, "review": "Good intro to planning course. Memorization heavy but content was very interesting, and I really liked the final assessment. Group project gets a point off, but if you're a planning project this group project is a good intro to the seemingly endless group projects throughout your degree."}, {"id": 2, "review": "A fantastic dive through the history of Planning. Lots of additional reading that you can do if you want to delve more into a particular subject, but little of it is required. The major assignments are kept pretty vague so you can chose a specific topic that interests you."}, {"id": 3, "review": "You'll do well if you attend lectures."}, {"id": 4, "review": "Took this course as an elective because i was generally interested in this topic and i was enjoying the material at first but the way this course is set up ruined it for me. All of your marks are based off of the TA's marking and there are 0 guidelines or rubrics for the presentation, term paper etc. so the ta can just haphazardly mark however tf they want with no comments or explanations and neither you nor even the prof would have any idea of where you lost the marks. I went from aiming for 90s to barely getting 70s so to sum up dont take this as an elective to boost your average"}, {"id": 5, "review": "I had to take this class for my major and didn't know I would love it this much. I am now going to continue and carry on with a minor. Super interesting!!"}, {"id": 6, "review": "urban history course; sounds like a legit prerequisite to me"}, {"id": 7, "review": "This course was what made me want to do an urban studies minor. The concepts of urban planning and development are fascinating. You learn about historical eras, but all in relation to how they influenced the development of cities and planning. The workload is quite light."}, {"id": 8, "review": "The course was interesting and related to the history of planning. If you like planning or history of cities in general, you'll like this course. Textbook is for a presentation worth 10% of the course and with that there is a midterm and final exam which are worth a lot but not too hard."}, {"id": 9, "review": "Some lectures are very interesting while others are incredibly boring. However, since taking this course I view cities in a different light."}, {"id": 10, "review": "Hate this course. Boring and hard to study for"}, {"id": 11, "review": "This class was very interesting as I love history! The assignment is very easy and the exams were very easy too, as long as you know the content (that means make sure you read the textbook even though it's super dry!)."}, {"id": 12, "review": "I was hoping to learn more about planning, but it was as the title indicates, just a review of its evolution"}, {"id": 13, "review": "This course was absolutely amazing. It's simple, with the midterm and final being three essay questions, you even get to choose which ones since there's five and you choose three of them to answer. Three of the questions are based on lectures and two of them are based on the textbook, so the textbook isn't really needed. It's only needed when you do a group presentation in your tutorial based on one chapter chosen, in this case you can just borrow the textbook from a friend. There is one essay which is so easy and you can do well if you put effort and thought into it. Attendance is also important since the midterm and final are mainly based on that."}, {"id": 14, "review": "This course is perfect for anyone. The history of cities is a topic that you will find yourself thinking about every time you walk down a city street. The structure of the course is linear and moves through time as cities have evolved. This class focuses mainly on cities in North America and Europe. You should buy the textbook because you will need it for a group assignment."}, {"id": 15, "review": "Pay attention during the lectures and you will do fine. Enjoyable class if you pay attention and have genuine interest in Planning"}, {"id": 16, "review": "The mid-term and final exam are the easiest thing ever. Even the term paper is incredibly easy just start researching ahead of time cause it's going to be really long and time consuming."}, {"id": 17, "review": "Interesting class if you attend the lectures and pay attention. Tutorial sections became very boring. Midterm and Final are easy if you understand the main themes and concepts from lectures and tutorial presentations."}, {"id": 18, "review": "Very important class, make sure to pay attention."}, {"id": 19, "review": "Overall, a really interesting course about planning and architectural movements. Topics in the course are really organized and easy to follow. Tutorials are all group presentations based on textbook chapters, so lecture and textbook content are completely separate. For the midterm and final, you get to choose 3 out of 5 essay-style questions. This year, 3 were from lectures and 2 were based on textbook content."}, {"id": 20, "review": "Easy course, just listen in class and it's easy to achieve over 80%. Exam and midterms are five essay questions and you choose three to answer. 3/5 questions are from lectures and 2/5 are from textbook. You only need the textbook for one chapter that you choose to present in a tut. So really, no textbook is needed and you can just borrow the textbook from a friend for that one chapter."}, {"id": 21, "review": "Must attend lectures in order to understand the content. Slides on LEARN are ususally ALL photos of maps so if you do not go - you will miss what you need to learn."}, {"id": 22, "review": "Loved this course! I didn't really read the textbook and just made sure I knew everything from the lectures to do the tests and still did fairly well because I took very thorough lecture notes. Tutorials seemed pretty useless/irrelevant."}, {"id": 23, "review": "The ideas and concepts you learn in PLAN100 are super interesting and quite relatable to the spaces you see around you. You don't need any previous knowledge on planning and architecture; lectures were like story-time! Do your readings and make sure you take notes in class."}, {"id": 24, "review": "PLAN 100 is a very interesting course that can be applied to multiple degrees. As an INDEV major the content learned in this class was very useful and helped connect the gaps between why so many cities in developing countries have failed to become structurally efficient. Midterms weren't too hard either and the presentation + paper were very easy. Overall it's an enjoyable class that's easy to do well in."}, {"id": 25, "review": "It was a very interesting course! Although the reading was dull, and was pretty demanding with a term paper, midterm, group presentation, and a final."}, {"id": 26, "review": "the prof was amazing, easy textbook, course notes were very clear and the assignments were challenging but not too hard. One large report, and a small outline of the report were the two assignments. I found the tutorial useless though.."}, {"id": 27, "review": "Keep up with readings!"}]}